RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/***************************************************************************//**
* \file cy_hppass_sar.h
* \version 1.30.1
*
* Header file for the SAR ADC subsystem of the High Power Programmable Analog Sub-System.
*
********************************************************************************
* \copyright
* Copyright (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_hppass_sar
* \{
* This driver provides API functions to configure the SAR ADC subsystem
* within High Power Programmable Analog Sub-System.
*
* \defgroup group_hppass_sar_macros Macros
* \{
*   \defgroup group_hppass_sar_direct_samplers Direct Sampler Masks
*   \defgroup group_hppass_sar_muxed_samplers Muxed Sampler Masks
*   \defgroup group_hppass_sar_result_interrupts Result Interrupt Masks
*   \defgroup group_hppass_sar_chan_idx Channel Indexes
*   \defgroup group_hppass_sar_status Result Status Masks
*   \defgroup group_hppass_sar_trigger Sequencer Group Trigger Collision Status Masks
*   \defgroup group_hppass_fifo_trigger FIFO Trigger Masks
    \defgroup group_hppass_sar_group_mask SAR Sequencer Group Masks
* \}
* \defgroup group_hppass_sar_functions Functions
* \{
*   \defgroup group_hppass_sar_chan Channel functions
*   \defgroup group_hppass_sar_fir FIR functions
*   \defgroup group_hppass_sar_fifo FIFO functions
* \}
*
* \defgroup group_hppass_sar_data_structures Data Structures
* \defgroup group_hppass_sar_enums Enumerated Types
*
* \} */

/**
* \addtogroup group_hppass_sar
* \{
* \section group_hppass_sar_initialization HW Initialization and Enable
* Configuration snippet for one shot SAR application.
* Startup SAR state enables SAR.
* One shot SAR measurement state triggers SAR to perform one measurement.
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_CFG_SAR_ONE_SHOT
* Functional snippet
* Application flow:
* - Startup AC microprogram enables SAR
* - Wait for SAR READY
* - Update AC microprogram to perform single measurement on channel 0
* - Steps below are repeated in loop
* - AC triggers the SAR
* - SAR generates SAR_ENTRY_DONE
* - SAR result is stored in CHAN_RESULT register
* - CHAN_RESULT register are printed out
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_FUNC_SAR_ONE_SHOT
*
* \section group_hppass_sar_interrupt Interrupt Configuration and Initialization
* To configure the SAR Group or Results interrupts in addition to the SAR and AC configuration tables, as shown in the snippet above,
* declare your own interrupt configuration structure for each interrupt source, for example:
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_ENTRYandRESULRS_INTR_CONFIG_STRUCRURE
* and initialize those configurations in the executable code. That code can be designed as a separate function (see the snippet below):
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_INTR_CONFIG_INITIALIZATION
* Also, initialize the NVIC through a separate function as well.
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_INTR_NVIC_INITIALIZATION
* The interrupt service routine for each of the interrupt sources must be implemented in the project.
* One of those interrupt service routines is shown below:
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_INTR_ENTRY0_ISR
* The configuration and initialization sequence for SAR interrupts is shown in the snippet below:
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_INTR_MAIN
*
* To generate SAR Limit or Limits interrupts, configure one or more limits and determine the limit for each
* SAR channel if needed.
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_LIMIT_CONFIG
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_LIMIT_SELECT
* That configurations must be also included in the fields of the SAR configuration structure (\ref cy_stc_hppass_sar_t):
* \snippet test_apps/hppass_sar_interrupts/main.c SNIPPET_HPPASS_SAR_CONFIG_STRUCT_LIMITS_IMPLEMENTATION
*
* \section fifo_interrupts FIFO Interrupts
* Using FIFO with MTB Device Configurator, since the FIFO has a single interrupt vector and need to be integrated with different
* solution personalities (like Motor Control) the Device Configurator itself generates the interrupt handler for entire FIFO
* with possibility to register individual callback for each FIFO buffer. See the generated source cycfg_peripherals.c for details.
* The runtime FIFO interrupt control can be done by the \ref Cy_HPPASS_FIFO_SetInterruptMask.
* The Device Configurator also generates the CYCFG_HPPASS_FIFO_INTR definition - the mask of all the used FIFO interrupt flags,
* which can be used with \ref Cy_HPPASS_FIFO_SetInterruptMask.
* When the HPPASS configurator 'start' feature is used - the Cy_HPPASS_FIFO_SetInterruptMask(CYCFG_HPPASS_FIFO_INTR)
* shall be called automatically during the generated init_cycfg_peripherals(); execution.
* \image html hppass_fifo_intr.png
* The Device Configurator generated HPPASS FIFO interrupt priority is 0 (because it is intended to drive the solution fast control loop),
* however it could be changed manually in the generated cycfg_HPPASS_FIFO_interrupt structure
* before the generated cycfg_HPPASS_FIFO_ISR_Init() execution (when the HPPASS Startup Initialize feature is disabled).
*
* \section FIR_Filter_Design FIR Filter Design
* The finite impulse response (FIR) is a generalized filter structure that allows getting all of the basic response types through varying its coefficients.
* Although the FIR structure allows implementing Low-pass filter (LPF), High-pass filter (HPF), Band-pass filter (BPF), and Band-stop filter (BSF), the recommended filter implementation in HPPASS CSG module is the LPF.
* Such a recommendation is based on a hardware HPPASS SAR FIR limitation, which is a maximum number of tap count equal to 16 taps.
* You can use any available FIR Calculator or FIR Design Tool for coefficient determination.<br>
* However, the chosen tool must allow you to:
* - Configure the filter response type to Low-pass.
* - Specify the Taps Quantity or Filter Order.
* - Set the Sample Frequency.
*
* \note The term <b><i>Tap Quantity</i></b> is similar to the <b><i>Filter Length</i></b> and is equal to the number of multipliers or coefficients in its structure.<br>
* The term <b><i>Filter Order</i></b> determines the number of states or input signal delays in the filter structure and is equal to the adders quantity.<br>
* The Filter Order can be calculated as follows:
* \code
* FilterOrder = TapsQuantity - 1
* \endcode
*
* There are various methods for FIR filter design to calculate FIR coefficients. Some tools allow you to choose the design method,
* but regardless of the exact chosen method, most FIR design tools require determining the desired frequency response parameters.<br>
* Generally, in case of the LPF FIR design that will be:
* \li <b>The frequency specifications:</b>
* - <b><i>Passband or Pass Frequency.</i></b> The passband is the frequency range where the signal passes through the filter with minimal attenuation.
* If only the Pass Frequency parameter is given, it implies that the passband starts from zero frequency and extends up to the specified Pass Frequency.
* - <b><i>Stopband or Stop Frequency.</i></b> The stopband is the frequency range where the signal is significantly attenuated or blocked by the filter.
* If only the Stop Frequency parameter is given, it implies that the stopband starts from the specified Stop Frequency and extends up to half of the sample frequency (Nyquist frequency).
* - Less often either in addition to or instead of the passband and stopband the <b><i>Transition Band</i></b> parameter could be present. The transition band lies between the passband and stopband.
* In this region, the filter's frequency response changes from minimal attenuation (in the passband) to significant attenuation (in the stopband).
* \li <b>The magnitude specifications:</b>
* - <b><i>Passband Ripple.</i></b> This parameter defines the allowed ripple (variation in dB) within the passband.
* - <b><i>Stopband Attenuation.</i></b> It specifies the minimum attenuation (in dB) required in the stopband.
*
* \image html hppass_fir_frequency_response.png
*
* The design method and parameters chosen ultimately determine the values of the filter coefficients.<br>
* After configuring the FIR filter and calculating the coefficients, you must check the obtained coefficient values.
* Due to the hardware HPPASS SAR FIR limitation, all filter coefficients must satisfy the conditions:
* \code
* (abs(Coef[0..15]) < 1) && (sum(abs(Coef[0..15])) < 8)
* \endcode
* If the obtained coefficients didn't comply with these conditions, you must change the FIR filter configurations.
* The most impact parameters to change the coefficients' values are the Sample Frequency and Transition Band width.<br>
* After calculating the coefficients and verifying the conditions, you must convert the floating-point coefficients to a fixed-point representation supported by the hardware.<br>
* The HPPASS SAR FIR stores its coefficients in the less significant 16 bits of the 32-bit registers in Q15 fixed-point format.
* \note The <b><i>Q15 fixed-point format</i></b> implies that the 15 less significant bits of the number represent its fractional part. Because the whole coefficient is a 16-bit value,<br>
* and 15 bits are reserved for the fractional part, the most significant bit is used as a sign extension. That is why the coefficients of the HPPASS SAR FIR cannot have an<br>
* integer part and their absolute value must be less than one, and the accurate coefficient values range is from -1 to 1-1/2^15.<br>
*
* To convert the floating-point coefficients to a Q15 fixed-point representation, use the equation below:
* \code
* Q15coef = round(DECcoef * 2^15)
* \endcode
* \} */

