RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
#if !defined(CY_HPPASS_SAR_H)
#define CY_HPPASS_SAR_H

#include "cy_device.h"

#ifdef CY_IP_MXS40MCPASS

#include "cy_hppass_ac.h"

#if defined(__cplusplus)
extern "C" {
#endif


/** \addtogroup group_hppass_sar_macros
*   \{ */

/** \cond INTERNAL */

/** Parameter validation macros */
#define CY_HPPASS_SAR_CHAN_NUM_VALID(chanIdx)   (CY_HPPASS_SAR_CHAN_NUM > (chanIdx))
#define CY_HPPASS_FIFO_NUM_VALID(fifoIdx)       (CY_HPPASS_FIFO_NUM > (fifoIdx))
#define CY_HPPASS_FIR_NUM_VALID(firIdx)         (CY_HPPASS_FIR_NUM > (firIdx))
#define CY_HPPASS_SAR_ADC_TEMP_VALID(val)       ((0 < (val)))
#define CY_HPPASS_SAR_TEMP_VALID(val)           ((-40 <= (val)) && (125 >= (val)))
#define CY_HPPASS_SAR_VREF_VALID(val)           ((1700U <= (val)) && (3600U >= (val)))

/** \endcond */

#define CY_HPPASS_SAR_GRP_NUM           (8U)  /**< The number of Sequencer Groups */
#define CY_HPPASS_SAR_CHAN_NUM          (28U) /**< The number of channels */
#define CY_HPPASS_SAR_SAMP_TIME_NUM     (3U)  /**< The number of sample timers */
#define CY_HPPASS_SAR_LIMIT_NUM         (8U)  /**< The number of limit crossing detection blocks */
#define CY_HPPASS_SAR_DIR_SAMP_NUM      (12U) /**< The number of the direct samplers */
#define CY_HPPASS_SAR_MUX_SAMP_NUM      (4U)  /**< The number of the muxed samplers */
#define CY_HPPASS_FIR_NUM               (2U)  /**< The number of FIR filters */
#define CY_HPPASS_FIR_TAP_NUM           (16U) /**< The number of FIR filter taps */
#define CY_HPPASS_FIFO_NUM              (4U)  /**< The number of the FIFO pieces */

#define CY_HPPASS_SAR_SAMPLERS_DISABLED     (0x0U) /**< All the samplers are disabled. */

/** \addtogroup group_hppass_sar_direct_samplers
*   \{ */
#define CY_HPPASS_SAR_DIRECT_SAMP_0         (0x001U) /**< Direct sampler #0  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_1         (0x002U) /**< Direct sampler #1  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_2         (0x004U) /**< Direct sampler #2  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_3         (0x008U) /**< Direct sampler #3  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_4         (0x010U) /**< Direct sampler #4  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_5         (0x020U) /**< Direct sampler #5  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_6         (0x040U) /**< Direct sampler #6  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_7         (0x080U) /**< Direct sampler #7  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_8         (0x100U) /**< Direct sampler #8  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_9         (0x200U) /**< Direct sampler #9  is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_10        (0x400U) /**< Direct sampler #10 is enabled. */
#define CY_HPPASS_SAR_DIRECT_SAMP_11        (0x800U) /**< Direct sampler #11 is enabled. */

/** Combined Direct samplers mask */
#define CY_HPPASS_SAR_DIRECT_SAMP           (HPPASS_SAR_CFG_SAMP_EN_DIRECT_SAMP_EN_Msk)
/** \} group_hppass_sar_direct_samplers */


/** \addtogroup group_hppass_sar_muxed_samplers
*   \{ */
#define CY_HPPASS_SAR_MUXED_SAMP_0          (0x1U) /**< Muxed sampler #0 is enabled. */
#define CY_HPPASS_SAR_MUXED_SAMP_1          (0x2U) /**< Muxed sampler #1 is enabled. */
#define CY_HPPASS_SAR_MUXED_SAMP_2          (0x4U) /**< Muxed sampler #2 is enabled. */
#define CY_HPPASS_SAR_MUXED_SAMP_3          (0x8U) /**< Muxed sampler #3 is enabled. */

/** Combined Muxed samplers mask */
#define CY_HPPASS_SAR_MUXED_SAMP            (CY_HPPASS_SAR_MUXED_SAMP_0 | \
                                             CY_HPPASS_SAR_MUXED_SAMP_1 | \
                                             CY_HPPASS_SAR_MUXED_SAMP_2 | \
                                             CY_HPPASS_SAR_MUXED_SAMP_3)
/** \} group_hppass_sar_muxed_samplers */

/** \addtogroup group_hppass_sar_group_mask
 *  To be used with \ref Cy_HPPASS_SAR_CrossTalkAdjust
 *   \{
 */
#define CY_HPPASS_SAR_GROUP_0_Msk (0x00001UL) /**< Mask for the SAR Sequencer Group #0 */
#define CY_HPPASS_SAR_GROUP_1_Msk (0x00002UL) /**< Mask for the SAR Sequencer Group #1 */
#define CY_HPPASS_SAR_GROUP_2_Msk (0x00004UL) /**< Mask for the SAR Sequencer Group #2 */
#define CY_HPPASS_SAR_GROUP_3_Msk (0x00008UL) /**< Mask for the SAR Sequencer Group #3 */
#define CY_HPPASS_SAR_GROUP_4_Msk (0x00010UL) /**< Mask for the SAR Sequencer Group #4 */
#define CY_HPPASS_SAR_GROUP_5_Msk (0x00020UL) /**< Mask for the SAR Sequencer Group #5 */
#define CY_HPPASS_SAR_GROUP_6_Msk (0x00040UL) /**< Mask for the SAR Sequencer Group #6 */
#define CY_HPPASS_SAR_GROUP_7_Msk (0x00080UL) /**< Mask for the SAR Sequencer Group #7 */
/** \} group_hppass_sar_group_mask */

/** \addtogroup group_hppass_sar_result_interrupts
 *  To be used with \ref Cy_HPPASS_SAR_Result_GetInterruptStatusMasked,
 *                  \ref Cy_HPPASS_SAR_Result_ClearInterrupt,
 *                  \ref Cy_HPPASS_SAR_Result_GetOverflowStatus,
 *                  \ref Cy_HPPASS_SAR_Result_ClearOverflowStatus
 *   \{
 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_0   (0x00001UL) /**< Result interrupt mask for the SAR Sequencer Group #0 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_1   (0x00002UL) /**< Result interrupt mask for the SAR Sequencer Group #1 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_2   (0x00004UL) /**< Result interrupt mask for the SAR Sequencer Group #2 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_3   (0x00008UL) /**< Result interrupt mask for the SAR Sequencer Group #3 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_4   (0x00010UL) /**< Result interrupt mask for the SAR Sequencer Group #4 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_5   (0x00020UL) /**< Result interrupt mask for the SAR Sequencer Group #5 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_6   (0x00040UL) /**< Result interrupt mask for the SAR Sequencer Group #6 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP_7   (0x00080UL) /**< Result interrupt mask for the SAR Sequencer Group #7 */
#define CY_HPPASS_INTR_SAR_RESULT_GROUP     (HPPASS_SAR_CFG_SAR_RESULT_INTR_ENTRY_DONE_Msk) /**< Combined SAR Sequencer Group result interrupt mask */

#define CY_HPPASS_INTR_SAR_RESULT_FIR_0     (0x10000UL) /**< Result interrupt mask for the FIR #0 */
#define CY_HPPASS_INTR_SAR_RESULT_FIR_1     (0x20000UL) /**< Result interrupt mask for the FIR #1 */
#define CY_HPPASS_INTR_SAR_RESULT_FIR       (HPPASS_SAR_CFG_SAR_RESULT_INTR_FIR_DONE_Msk)   /**< Combined FIR result interrupt mask */

