RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/** Combined RESULT interrupt mask */
#define CY_HPPASS_INTR_SAR_RESULT           (HPPASS_SAR_CFG_SAR_RESULT_INTR_ENTRY_DONE_Msk | \
                                             HPPASS_SAR_CFG_SAR_RESULT_INTR_FIR_DONE_Msk)
/** \} group_hppass_sar_result_interrupts */

/** \addtogroup group_hppass_sar_limit_interrupts
 *  To be used with \ref Cy_HPPASS_SAR_Limit_GetInterruptStatusMasked,
 *                  \ref Cy_HPPASS_SAR_Limit_ClearInterrupt
 *   \{
 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_0    (0x01UL) /**< Limit interrupt mask for the SAR Sequencer Group #0 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_1    (0x02UL) /**< Limit interrupt mask for the SAR Sequencer Group #1 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_2    (0x04UL) /**< Limit interrupt mask for the SAR Sequencer Group #2 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_3    (0x08UL) /**< Limit interrupt mask for the SAR Sequencer Group #3 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_4    (0x10UL) /**< Limit interrupt mask for the SAR Sequencer Group #4 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_5    (0x20UL) /**< Limit interrupt mask for the SAR Sequencer Group #5 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_6    (0x40UL) /**< Limit interrupt mask for the SAR Sequencer Group #6 */
#define CY_HPPASS_INTR_SAR_LIMIT_GROUP_7    (0x80UL) /**< Limit interrupt mask for the SAR Sequencer Group #7 */
#define CY_HPPASS_INTR_SAR_LIMIT            (HPPASS_SAR_CFG_SAR_RANGE_INTR_RANGE_Msk) /**< Combined SAR limit interrupt mask */
/** \} group_hppass_sar_limit_interrupts */

/** \addtogroup group_hppass_fifo_level_interrupts
 *  To be used with \ref Cy_HPPASS_FIFO_GetInterruptStatus,
 *                  \ref Cy_HPPASS_FIFO_GetInterruptStatusMasked,
 *                  \ref Cy_HPPASS_FIFO_SetInterrupt,
 *                  \ref Cy_HPPASS_FIFO_ClearInterrupt,
 *                  \ref Cy_HPPASS_FIFO_SetInterruptMask,
 *                  \ref Cy_HPPASS_FIFO_GetInterruptMask
 *   \{
 */
#define CY_HPPASS_INTR_FIFO_0_LEVEL         (0x1UL) /**< FIFO #0 level interrupt mask */
#define CY_HPPASS_INTR_FIFO_1_LEVEL         (0x2UL) /**< FIFO #1 level interrupt mask */
#define CY_HPPASS_INTR_FIFO_2_LEVEL         (0x4UL) /**< FIFO #2 level interrupt mask */
#define CY_HPPASS_INTR_FIFO_3_LEVEL         (0x8UL) /**< FIFO #3 level interrupt mask */
#define CY_HPPASS_INTR_FIFO                 (HPPASS_MMIO_FIFO_INTR_FIFO_LEVEL_Msk) /**< Combined FIFO level interrupt mask */
/** \} group_hppass_fifo_level_interrupts */

/** \addtogroup group_hppass_fifo_trigger
 *  To be used with \ref Cy_HPPASS_FIFO_Config
 *   \{
 */
#define CY_HPPASS_FIFO_0_TRIG   (0x01UL) /**< FIFO #0 trigger mask */
#define CY_HPPASS_FIFO_1_TRIG   (0x02UL) /**< FIFO #1 trigger mask */
#define CY_HPPASS_FIFO_2_TRIG   (0x04UL) /**< FIFO #2 trigger mask */
#define CY_HPPASS_FIFO_3_TRIG   (0x08UL) /**< FIFO #3 trigger mask */
/** \} group_hppass_fifo_trigger */

/** \addtogroup group_hppass_sar_chan_idx
 *  To be used with \ref Cy_HPPASS_FIFO_Read,
 *                  \ref Cy_HPPASS_FIFO_ReadAll,
 *                  \ref Cy_HPPASS_SAR_Result_ChannelRead
 *  \{
 */
#define CY_HPPASS_SAR_CHAN_0_IDX  (0U)  /**< The Index of the SAR Channel #0 */
#define CY_HPPASS_SAR_CHAN_1_IDX  (1U)  /**< The Index of the SAR Channel #1 */
#define CY_HPPASS_SAR_CHAN_2_IDX  (2U)  /**< The Index of the SAR Channel #2 */
#define CY_HPPASS_SAR_CHAN_3_IDX  (3U)  /**< The Index of the SAR Channel #3 */
#define CY_HPPASS_SAR_CHAN_4_IDX  (4U)  /**< The Index of the SAR Channel #4 */
#define CY_HPPASS_SAR_CHAN_5_IDX  (5U)  /**< The Index of the SAR Channel #5 */
#define CY_HPPASS_SAR_CHAN_6_IDX  (6U)  /**< The Index of the SAR Channel #6 */
#define CY_HPPASS_SAR_CHAN_7_IDX  (7U)  /**< The Index of the SAR Channel #7 */
#define CY_HPPASS_SAR_CHAN_8_IDX  (8U)  /**< The Index of the SAR Channel #8 */
#define CY_HPPASS_SAR_CHAN_9_IDX  (9U)  /**< The Index of the SAR Channel #9 */
#define CY_HPPASS_SAR_CHAN_10_IDX (10U) /**< The Index of the SAR Channel #10 */
#define CY_HPPASS_SAR_CHAN_11_IDX (11U) /**< The Index of the SAR Channel #11 */
#define CY_HPPASS_SAR_CHAN_12_IDX (12U) /**< The Index of the SAR Channel #12 */
#define CY_HPPASS_SAR_CHAN_13_IDX (13U) /**< The Index of the SAR Channel #13 */
#define CY_HPPASS_SAR_CHAN_14_IDX (14U) /**< The Index of the SAR Channel #14 */
#define CY_HPPASS_SAR_CHAN_15_IDX (15U) /**< The Index of the SAR Channel #15 */
#define CY_HPPASS_SAR_CHAN_16_IDX (16U) /**< The Index of the SAR Channel #16 */
#define CY_HPPASS_SAR_CHAN_17_IDX (17U) /**< The Index of the SAR Channel #17 */
#define CY_HPPASS_SAR_CHAN_18_IDX (18U) /**< The Index of the SAR Channel #18 */
#define CY_HPPASS_SAR_CHAN_19_IDX (19U) /**< The Index of the SAR Channel #19 */
#define CY_HPPASS_SAR_CHAN_20_IDX (20U) /**< The Index of the SAR Channel #20 */
#define CY_HPPASS_SAR_CHAN_21_IDX (21U) /**< The Index of the SAR Channel #21 */
#define CY_HPPASS_SAR_CHAN_22_IDX (22U) /**< The Index of the SAR Channel #22 */
#define CY_HPPASS_SAR_CHAN_23_IDX (23U) /**< The Index of the SAR Channel #23 */
#define CY_HPPASS_SAR_CHAN_24_IDX (24U) /**< The Index of the SAR Channel #24 */
#define CY_HPPASS_SAR_CHAN_25_IDX (25U) /**< The Index of the SAR Channel #25 */
#define CY_HPPASS_SAR_CHAN_26_IDX (26U) /**< The Index of the SAR Channel #26 */
#define CY_HPPASS_SAR_CHAN_27_IDX (27U) /**< The Index of the SAR Channel #27 */
#define CY_HPPASS_SAR_FIR_0_IDX   (30U) /**< The Index of the FIR Channel #0 */
#define CY_HPPASS_SAR_FIR_1_IDX   (31U) /**< The Index of the FIR Channel #1 */
/** \} group_hppass_sar_chan_idx */

/** \addtogroup group_hppass_sar_status
 *  To be used with \ref Cy_HPPASS_SAR_Result_GetStatus,
 *                  \ref Cy_HPPASS_SAR_Result_ClearStatus,
 *                  \ref Cy_HPPASS_SAR_Limit_GetStatus,
 *                  \ref Cy_HPPASS_SAR_Limit_ClearStatus
 *  \{
 */
#define CY_HPPASS_SAR_CHAN_0_MSK  (1UL << CY_HPPASS_SAR_CHAN_0_IDX)  /**< The Status mask for the SAR Channel #0 */
#define CY_HPPASS_SAR_CHAN_1_MSK  (1UL << CY_HPPASS_SAR_CHAN_1_IDX)  /**< The Status mask for the SAR Channel #1 */
#define CY_HPPASS_SAR_CHAN_2_MSK  (1UL << CY_HPPASS_SAR_CHAN_2_IDX)  /**< The Status mask for the SAR Channel #2 */
#define CY_HPPASS_SAR_CHAN_3_MSK  (1UL << CY_HPPASS_SAR_CHAN_3_IDX)  /**< The Status mask for the SAR Channel #3 */
#define CY_HPPASS_SAR_CHAN_4_MSK  (1UL << CY_HPPASS_SAR_CHAN_4_IDX)  /**< The Status mask for the SAR Channel #4 */
#define CY_HPPASS_SAR_CHAN_5_MSK  (1UL << CY_HPPASS_SAR_CHAN_5_IDX)  /**< The Status mask for the SAR Channel #5 */
#define CY_HPPASS_SAR_CHAN_6_MSK  (1UL << CY_HPPASS_SAR_CHAN_6_IDX)  /**< The Status mask for the SAR Channel #6 */
#define CY_HPPASS_SAR_CHAN_7_MSK  (1UL << CY_HPPASS_SAR_CHAN_7_IDX)  /**< The Status mask for the SAR Channel #7 */
#define CY_HPPASS_SAR_CHAN_8_MSK  (1UL << CY_HPPASS_SAR_CHAN_8_IDX)  /**< The Status mask for the SAR Channel #8 */
#define CY_HPPASS_SAR_CHAN_9_MSK  (1UL << CY_HPPASS_SAR_CHAN_9_IDX)  /**< The Status mask for the SAR Channel #9 */
#define CY_HPPASS_SAR_CHAN_10_MSK (1UL << CY_HPPASS_SAR_CHAN_10_IDX) /**< The Status mask for the SAR Channel #10 */
#define CY_HPPASS_SAR_CHAN_11_MSK (1UL << CY_HPPASS_SAR_CHAN_11_IDX) /**< The Status mask for the SAR Channel #11 */
#define CY_HPPASS_SAR_CHAN_12_MSK (1UL << CY_HPPASS_SAR_CHAN_12_IDX) /**< The Status mask for the SAR Channel #12 */
#define CY_HPPASS_SAR_CHAN_13_MSK (1UL << CY_HPPASS_SAR_CHAN_13_IDX) /**< The Status mask for the SAR Channel #13 */
#define CY_HPPASS_SAR_CHAN_14_MSK (1UL << CY_HPPASS_SAR_CHAN_14_IDX) /**< The Status mask for the SAR Channel #14 */
#define CY_HPPASS_SAR_CHAN_15_MSK (1UL << CY_HPPASS_SAR_CHAN_15_IDX) /**< The Status mask for the SAR Channel #15 */
#define CY_HPPASS_SAR_CHAN_16_MSK (1UL << CY_HPPASS_SAR_CHAN_16_IDX) /**< The Status mask for the SAR Channel #16 */
#define CY_HPPASS_SAR_CHAN_17_MSK (1UL << CY_HPPASS_SAR_CHAN_17_IDX) /**< The Status mask for the SAR Channel #17 */
#define CY_HPPASS_SAR_CHAN_18_MSK (1UL << CY_HPPASS_SAR_CHAN_18_IDX) /**< The Status mask for the SAR Channel #18 */
#define CY_HPPASS_SAR_CHAN_19_MSK (1UL << CY_HPPASS_SAR_CHAN_19_IDX) /**< The Status mask for the SAR Channel #19 */
#define CY_HPPASS_SAR_CHAN_20_MSK (1UL << CY_HPPASS_SAR_CHAN_20_IDX) /**< The Status mask for the SAR Channel #20 */
#define CY_HPPASS_SAR_CHAN_21_MSK (1UL << CY_HPPASS_SAR_CHAN_21_IDX) /**< The Status mask for the SAR Channel #21 */
#define CY_HPPASS_SAR_CHAN_22_MSK (1UL << CY_HPPASS_SAR_CHAN_22_IDX) /**< The Status mask for the SAR Channel #22 */
#define CY_HPPASS_SAR_CHAN_23_MSK (1UL << CY_HPPASS_SAR_CHAN_23_IDX) /**< The Status mask for the SAR Channel #23 */
#define CY_HPPASS_SAR_CHAN_24_MSK (1UL << CY_HPPASS_SAR_CHAN_24_IDX) /**< The Status mask for the SAR Channel #24 */
#define CY_HPPASS_SAR_CHAN_25_MSK (1UL << CY_HPPASS_SAR_CHAN_25_IDX) /**< The Status mask for the SAR Channel #25 */
#define CY_HPPASS_SAR_CHAN_26_MSK (1UL << CY_HPPASS_SAR_CHAN_26_IDX) /**< The Status mask for the SAR Channel #26 */
#define CY_HPPASS_SAR_CHAN_27_MSK (1UL << CY_HPPASS_SAR_CHAN_27_IDX) /**< The Status mask for the SAR Channel #27 */
#define CY_HPPASS_SAR_FIR_0_MSK   (1UL << CY_HPPASS_SAR_FIR_0_IDX)   /**< The Status mask for the FIR Channel #0 */
#define CY_HPPASS_SAR_FIR_1_MSK   (1UL << CY_HPPASS_SAR_FIR_1_IDX)   /**< The Status mask for the FIR Channel #1 */

