RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/** The Common Status mask for all the ADC and FIR channels */
#define CY_HPPASS_SAR_CHAN_MSK (CY_HPPASS_SAR_CHAN_0_MSK | \
                                CY_HPPASS_SAR_CHAN_1_MSK | \
                                CY_HPPASS_SAR_CHAN_2_MSK | \
                                CY_HPPASS_SAR_CHAN_3_MSK | \
                                CY_HPPASS_SAR_CHAN_4_MSK | \
                                CY_HPPASS_SAR_CHAN_5_MSK | \
                                CY_HPPASS_SAR_CHAN_6_MSK | \
                                CY_HPPASS_SAR_CHAN_7_MSK | \
                                CY_HPPASS_SAR_CHAN_8_MSK | \
                                CY_HPPASS_SAR_CHAN_9_MSK | \
                                CY_HPPASS_SAR_CHAN_10_MSK | \
                                CY_HPPASS_SAR_CHAN_11_MSK | \
                                CY_HPPASS_SAR_CHAN_12_MSK | \
                                CY_HPPASS_SAR_CHAN_13_MSK | \
                                CY_HPPASS_SAR_CHAN_14_MSK | \
                                CY_HPPASS_SAR_CHAN_15_MSK | \
                                CY_HPPASS_SAR_CHAN_16_MSK | \
                                CY_HPPASS_SAR_CHAN_17_MSK | \
                                CY_HPPASS_SAR_CHAN_18_MSK | \
                                CY_HPPASS_SAR_CHAN_19_MSK | \
                                CY_HPPASS_SAR_CHAN_20_MSK | \
                                CY_HPPASS_SAR_CHAN_21_MSK | \
                                CY_HPPASS_SAR_CHAN_22_MSK | \
                                CY_HPPASS_SAR_CHAN_23_MSK | \
                                CY_HPPASS_SAR_CHAN_24_MSK | \
                                CY_HPPASS_SAR_CHAN_25_MSK | \
                                CY_HPPASS_SAR_CHAN_26_MSK | \
                                CY_HPPASS_SAR_CHAN_27_MSK | \
                                CY_HPPASS_SAR_FIR_0_MSK | \
                                CY_HPPASS_SAR_FIR_1_MSK)
/** \} group_hppass_sar_status */

/** \addtogroup group_hppass_sar_trigger
 *  To be used with \ref Cy_HPPASS_SAR_GetTriggerCollisionStatus,
 *                  \ref Cy_HPPASS_SAR_ClearTriggerCollisionStatus
 *  \{
 */
#define CY_HPPASS_SAR_GROUP_0_TRIG_COLLISION (0x01U) /**< Trigger collision mask Group #0 */
#define CY_HPPASS_SAR_GROUP_1_TRIG_COLLISION (0x02U) /**< Trigger collision mask Group #1 */
#define CY_HPPASS_SAR_GROUP_2_TRIG_COLLISION (0x04U) /**< Trigger collision mask Group #2 */
#define CY_HPPASS_SAR_GROUP_3_TRIG_COLLISION (0x08U) /**< Trigger collision mask Group #3 */
#define CY_HPPASS_SAR_GROUP_4_TRIG_COLLISION (0x10U) /**< Trigger collision mask Group #4 */
#define CY_HPPASS_SAR_GROUP_5_TRIG_COLLISION (0x20U) /**< Trigger collision mask Group #5 */
#define CY_HPPASS_SAR_GROUP_6_TRIG_COLLISION (0x40U) /**< Trigger collision mask Group #6 */
#define CY_HPPASS_SAR_GROUP_7_TRIG_COLLISION (0x80U) /**< Trigger collision mask Group #7 */
/** \} group_hppass_sar_trigger */

/** The pointer to the Channel Result register, useful for e.g. DMA descriptor initialization */
#define CY_HPPASS_SAR_CHAN_RSLT_PTR(chanIdx) ((volatile const uint32_t *)&HPPASS_SAR_CHAN_RESULT(HPPASS_BASE, (chanIdx)))

/** The pointer to the FIR Result register, useful for e.g. DMA descriptor initialization */
#define CY_HPPASS_SAR_FIR_RSLT_PTR(firIdx) ((volatile const uint32_t *)&HPPASS_SAR_FIR_RESULT(HPPASS_BASE, (firIdx)))

/** The pointer to the FIFO Read Data register, useful for e.g. DMA descriptor initialization */
#define CY_HPPASS_SAR_FIFO_READ_PTR(fifoIdx) ((volatile const uint32_t *)&HPPASS_MMIO_FIFO_RD_DATA(HPPASS_BASE, (fifoIdx)))
/** \} group_hppass_sar_macros */

/** \cond Internal macros */
/* Value validation macros */
#define CY_HPPASS_SAR_GROUP_HOLD_CNT_VALID(value)   ((0U < (value)) && (256U >= (value)))

#define CY_HPPASS_COND_VALID(cond)          ((CY_HPPASS_SAR_COND_BELOW  == (cond)) || \
                                            (CY_HPPASS_SAR_COND_INSIDE  == (cond)) || \
                                            (CY_HPPASS_SAR_COND_ABOVE   == (cond)) || \
                                            (CY_HPPASS_SAR_COND_OUTSIDE == (cond)))

#define CY_HPPASS_CHAN_VALID(chan)          ((CY_HPPASS_FIR_DISABLED == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_0    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_1    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_2    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_3    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_4    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_5    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_6    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_7    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_8    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_9    == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_10   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_11   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_12   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_13   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_14   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_15   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_16   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_17   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_18   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_19   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_20   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_21   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_22   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_23   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_24   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_25   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_26   == (chan)) || \
                                            (CY_HPPASS_FIR_CHAN_27   == (chan)))

#define CY_HPPASS_LIMIT_VALID(limit)        ((CY_HPPASS_SAR_LIMIT_DISABLED == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_0         == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_1         == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_2         == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_3         == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_4         == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_5         == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_6         == (limit)) || \
                                            (CY_HPPASS_SAR_LIMIT_7         == (limit)))

#define CY_HPPASS_FIFO_VALID(fifo)          ((CY_HPPASS_FIFO_DISABLED == (fifo)) || \
                                            (CY_HPPASS_FIFO_0         == (fifo)) || \
                                            (CY_HPPASS_FIFO_1         == (fifo)) || \
                                            (CY_HPPASS_FIFO_2         == (fifo)) || \
                                            (CY_HPPASS_FIFO_3         == (fifo)))

#define CY_HPPASS_AVG_VALID(avg)            ((CY_HPPASS_SAR_AVG_DISABLED == (avg)) || \
                                            (CY_HPPASS_SAR_AVG_2         == (avg)) || \
                                            (CY_HPPASS_SAR_AVG_4         == (avg)) || \
                                            (CY_HPPASS_SAR_AVG_8         == (avg)) || \
                                            (CY_HPPASS_SAR_AVG_16        == (avg)) || \
                                            (CY_HPPASS_SAR_AVG_32        == (avg)))

#define CY_HPPASS_MODE_VALID(mode)          ((CY_HPPASS_FIFO_1_32 == (mode)) || \
                                            (CY_HPPASS_FIFO_2_16  == (mode)) || \
                                            (CY_HPPASS_FIFO_4_8   == (mode)))

#define CY_HPPASS_LEVEL_VALID(mode, level)  ((0U < level) && (((CY_HPPASS_FIFO_1_32 == mode) ? 32U : \
                                                              ((CY_HPPASS_FIFO_2_16 == mode) ? 16U : 8U)) >= level))

