RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
#define CY_HPPASS_TRIGMSK_VALID(trigMsk)    (0U == ((trigMsk) & ((uint8_t) ~(CY_HPPASS_FIFO_0_TRIG | \
                                                                             CY_HPPASS_FIFO_1_TRIG | \
                                                                             CY_HPPASS_FIFO_2_TRIG | \
                                                                             CY_HPPASS_FIFO_3_TRIG))))

#define CY_HPPASS_SAR_LIMIT_LOW_VALID(low)      ((65535L > (low))   && (-32768L <= (low)))
#define CY_HPPASS_SAR_LIMIT_HIGH_VALID(high)    ((65535L >= (high)) && (-32768L < (high)))
/** \endcond */


/***************************************
*       Enumerated Types
***************************************/


/**
* \addtogroup group_hppass_sar_enums
* \{
*/


/** SAR voltage reference source */
typedef enum
{
    CY_HPPASS_SAR_VREF_VDDA = 0U, /**< VDDA reference */
    CY_HPPASS_SAR_VREF_EXT  = 1U  /**< External reference */
} cy_en_hppass_sar_vref_t;


/** The limit crossing detection condition */
typedef enum
{
    CY_HPPASS_SAR_COND_BELOW   = 0U, /**< Result < LIMIT_LOW */
    CY_HPPASS_SAR_COND_INSIDE  = 1U, /**< LIMIT_LOW <= result < LIMIT_HIGH */
    CY_HPPASS_SAR_COND_ABOVE   = 2U, /**< Result > LIMIT_HIGH */
    CY_HPPASS_SAR_COND_OUTSIDE = 3U, /**< Result < LIMIT_LOW || result >= LIMIT_HIGH */
} cy_en_hppass_sar_cond_t;


/** Trigger sources selection */
typedef enum
{
    CY_HPPASS_SAR_TRIG_DISABLED = 0U, /**< Triggering is disabled */
    CY_HPPASS_SAR_TRIG_0        = 1U, /**< Trigger 0 */
    CY_HPPASS_SAR_TRIG_1        = 2U, /**< Trigger 1 */
    CY_HPPASS_SAR_TRIG_2        = 3U, /**< Trigger 2 */
    CY_HPPASS_SAR_TRIG_3        = 4U, /**< Trigger 3 */
    CY_HPPASS_SAR_TRIG_4        = 5U, /**< Trigger 4 */
    CY_HPPASS_SAR_TRIG_5        = 6U, /**< Trigger 5 */
    CY_HPPASS_SAR_TRIG_6        = 7U, /**< Trigger 6 */
    CY_HPPASS_SAR_TRIG_7        = 8U, /**< Trigger 7 */
    CY_HPPASS_SAR_TRIG_AC       = 9U, /**< Trigger from the Autonomous Controller */
} cy_en_hppass_sar_trig_t;


/** Sampling Timer selection */
typedef enum
{
    CY_HPPASS_SAR_SAMP_TIME_DISABLED = 0U, /**< Sampling Timer is not used */
    CY_HPPASS_SAR_SAMP_TIME_0        = 1U, /**< Sampling Timer 0 */
    CY_HPPASS_SAR_SAMP_TIME_1        = 2U, /**< Sampling Timer 1 */
    CY_HPPASS_SAR_SAMP_TIME_2        = 3U, /**< Sampling Timer 2 */
} cy_en_hppass_sar_samp_time_t;


/** Sampler Gain selection */
typedef enum
{
    CY_HPPASS_SAR_SAMP_GAIN_1  = 0U, /**< Sampler Gain = 1 */
    CY_HPPASS_SAR_SAMP_GAIN_3  = 1U, /**< Sampler Gain = 3 */
    CY_HPPASS_SAR_SAMP_GAIN_6  = 2U, /**< Sampler Gain = 6 */
    CY_HPPASS_SAR_SAMP_GAIN_12 = 3U, /**< Sampler Gain = 12 */
} cy_en_hppass_sar_samp_gain_t;


/** Input channel selection for FIR filter */
typedef enum
{
    CY_HPPASS_FIR_DISABLED   = 0U,   /**< DISABLED */
    CY_HPPASS_FIR_CHAN_0     = 1U,   /**< Channel 0 */
    CY_HPPASS_FIR_CHAN_1     = 2U,   /**< Channel 1 */
    CY_HPPASS_FIR_CHAN_2     = 3U,   /**< Channel 2 */
    CY_HPPASS_FIR_CHAN_3     = 4U,   /**< Channel 3 */
    CY_HPPASS_FIR_CHAN_4     = 5U,   /**< Channel 4 */
    CY_HPPASS_FIR_CHAN_5     = 6U,   /**< Channel 5 */
    CY_HPPASS_FIR_CHAN_6     = 7U,   /**< Channel 6 */
    CY_HPPASS_FIR_CHAN_7     = 8U,   /**< Channel 7 */
    CY_HPPASS_FIR_CHAN_8     = 9U,   /**< Channel 8 */
    CY_HPPASS_FIR_CHAN_9     = 10U,  /**< Channel 9 */
    CY_HPPASS_FIR_CHAN_10    = 11U,  /**< Channel 10 */
    CY_HPPASS_FIR_CHAN_11    = 12U,  /**< Channel 11 */
    CY_HPPASS_FIR_CHAN_12    = 13U,  /**< Channel 12 */
    CY_HPPASS_FIR_CHAN_13    = 14U,  /**< Channel 13 */
    CY_HPPASS_FIR_CHAN_14    = 15U,  /**< Channel 14 */
    CY_HPPASS_FIR_CHAN_15    = 16U,  /**< Channel 15 */
    CY_HPPASS_FIR_CHAN_16    = 17U,  /**< Channel 16 */
    CY_HPPASS_FIR_CHAN_17    = 18U,  /**< Channel 17 */
    CY_HPPASS_FIR_CHAN_18    = 19U,  /**< Channel 18 */
    CY_HPPASS_FIR_CHAN_19    = 20U,  /**< Channel 19 */
    CY_HPPASS_FIR_CHAN_20    = 21U,  /**< Channel 20 */
    CY_HPPASS_FIR_CHAN_21    = 22U,  /**< Channel 21 */
    CY_HPPASS_FIR_CHAN_22    = 23U,  /**< Channel 22 */
    CY_HPPASS_FIR_CHAN_23    = 24U,  /**< Channel 23 */
    CY_HPPASS_FIR_CHAN_24    = 25U,  /**< Channel 24 */
    CY_HPPASS_FIR_CHAN_25    = 26U,  /**< Channel 25 */
    CY_HPPASS_FIR_CHAN_26    = 27U,  /**< Channel 26 */
    CY_HPPASS_FIR_CHAN_27    = 28U,  /**< Channel 27 */
} cy_en_hppass_fir_chan_t;


/** Limit crossing detector selection */
typedef enum
{
    CY_HPPASS_SAR_LIMIT_DISABLED = 0U, /**< DISABLED */
    CY_HPPASS_SAR_LIMIT_0        = 1U, /**< Limit detector #0 */
    CY_HPPASS_SAR_LIMIT_1        = 2U, /**< Limit detector #1 */
    CY_HPPASS_SAR_LIMIT_2        = 3U, /**< Limit detector #2 */
    CY_HPPASS_SAR_LIMIT_3        = 4U, /**< Limit detector #3 */
    CY_HPPASS_SAR_LIMIT_4        = 5U, /**< Limit detector #4 */
    CY_HPPASS_SAR_LIMIT_5        = 6U, /**< Limit detector #5 */
    CY_HPPASS_SAR_LIMIT_6        = 7U, /**< Limit detector #6 */
    CY_HPPASS_SAR_LIMIT_7        = 8U, /**< Limit detector #7 */
} cy_en_hppass_sar_limit_t;


/** FIFO selection */
typedef enum
{
    CY_HPPASS_FIFO_DISABLED = 0U, /**< DISABLED */
    CY_HPPASS_FIFO_0        = 1U, /**< FIFO #0 */
    CY_HPPASS_FIFO_1        = 2U, /**< FIFO #1 */
    CY_HPPASS_FIFO_2        = 3U, /**< FIFO #2 */
    CY_HPPASS_FIFO_3        = 4U, /**< FIFO #3 */
} cy_en_hppass_fifo_t;


/** FIFO dividing mode selection */
typedef enum
{
    CY_HPPASS_FIFO_1_32 = 0U, /**< The FIFO block is configured as a single 32-entry FIFO buffer (FIFO_0) */
    CY_HPPASS_FIFO_2_16 = 1U, /**< The FIFO block is divided into two 16-entry FIFO buffers (FIFO_0, FIFO_1) */
    CY_HPPASS_FIFO_4_8  = 2U, /**< The FIFO block is divided into four 8-entry FIFO buffers (FIFO_0, FIFO_1, FIFO_2, FIFO_3) */
} cy_en_hppass_fifo_mode_t;


/** SAR averaging selection */
typedef enum
{
    CY_HPPASS_SAR_AVG_DISABLED = 0U, /**< Averaging is disabled */
    CY_HPPASS_SAR_AVG_2        = 1U, /**< Averaging 2 */
    CY_HPPASS_SAR_AVG_4        = 2U, /**< Averaging 4 */
    CY_HPPASS_SAR_AVG_8        = 3U, /**< Averaging 8 */
    CY_HPPASS_SAR_AVG_16       = 4U, /**< Averaging 16 */
    CY_HPPASS_SAR_AVG_32       = 5U, /**< Averaging 32 */
} cy_en_hppass_sar_avg_t;


