RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/** Analog routing/muxing control mode */
typedef enum
{
    CY_HPPASS_SAR_MUX_SEQ = 0U, /**< The MUX is controlled by \ref cy_stc_hppass_sar_grp_t::muxChanIdx */
    CY_HPPASS_SAR_MUX_FW  = 1U, /**< The MUX is controlled by FW only,
                                 *   using \ref Cy_HPPASS_SAR_SetSwitch and
                                 *         \ref Cy_HPPASS_SAR_ClearSwitch
                                 */
    CY_HPPASS_SAR_MUX_AC  = 2U, /**< The MUX is controlled by \ref cy_stc_hppass_stt_mux_t::chanIdx */
} cy_en_hppass_sar_mux_t;


/** Temperature sensor current control */
typedef enum

{
    CY_HPPASS_SAR_TEMP_SENSOR_CURRENT_LO = 0U, /**< The BJT current is 1uA (Low) */
    CY_HPPASS_SAR_TEMP_SENSOR_CURRENT_HI = 1U, /**< Add 8uA to BJT current (High)*/
} cy_en_hppass_sar_temp_sensor_current_t;

/** \} group_hppass_sar_enums */


/***************************************
*       Configuration Structures
***************************************/


/**
* \addtogroup group_hppass_sar_data_structures
* \{
*/


/** The SAR Sequencer Table Entry configuration structure */
typedef struct
{
    uint16_t dirSampMsk;                        /**< Direct samplers enable mask, each bit corresponds to one
                                                 *   of the 12 direct samplers. Zero bit of this mask corresponds
                                                 *   to sampler 0, first bit to sampler 1 and so on. Bits 12 to 15
                                                 *   are not used. When this Entry is triggered, any samplers with
                                                 *   a bit set to '1' will be simultaneously sampled, held, and
                                                 *   then converted. There is a 1-1 correspondence between these
                                                 *   12 samplers and the first 12 result channels. SAR results
                                                 *   can be read using \ref Cy_HPPASS_SAR_Result_ChannelRead
                                                 *   with corresponding channel index.
                                                 */
    uint8_t muxSampMsk;                         /**< Muxed samplers enable mask, each bit corresponds to one of
                                                 *   the 4 muxed samplers. Zero bit of this mask corresponds to
                                                 *   sampler 0, first bit to sampler 1 and so on. Bits 4 to 7
                                                 *   are not used. When this Entry is triggered, any samplers
                                                 *   with a bit set to '1' will be simultaneously sampled, held,
                                                 *   and then converted. Each one of these samplers maps to 4
                                                 *   result channels as determined by the mux setting 0, 1, 2,
                                                 *   or 3 in order, using cy_stc_hppass_sar_grp_t::muxChanIdx
                                                 *   field.
                                                 *   The mapping is:
                                                 *   * bit 0 (sampler 12) can sample 12, 13, 14, 15 channels
                                                 *   * bit 1 (sampler 13) can sample 16, 17, 18, 19 channels
                                                 *   * bit 2 (sampler 14) can sample 20, 21, 22, 23 channels
                                                 *   * bit 3 (sampler 15) can sample 24, 25, 26, 27 channels
                                                 *
                                                 *   SAR results can be read using
                                                 *   \ref Cy_HPPASS_SAR_Result_ChannelRead with corresponding
                                                 *   channel index.
                                                 */
    uint8_t muxChanIdx[CY_HPPASS_SAR_MUX_NUM];  /**< Muxed Sampler Channel selection for sampler 12, 13, 14 and 15.
                                                 *   Valid Range: 0...3
                                                 *   Effective only if the correspondent
                                                 *   \ref cy_stc_hppass_sar_t::muxMode == \ref CY_HPPASS_SAR_MUX_SEQ
                                                 *   (the default option), otherwise ignored.
                                                 */
    cy_en_hppass_sar_trig_t trig;               /**< Input Trigger selection. Pulse and Level triggers may be used.
                                                 *   When the Level trigger is used, trigger event is on the rising
                                                 *   edge of the trigger.
                                                 */
    cy_en_hppass_sar_samp_time_t sampTime;      /**< Sampling Timer Selection. Choose one out of four available
                                                 *   Sample Timers: \ref cy_stc_hppass_sar_t::sampTime
                                                 */
    bool priority;                              /**< Priority: false - low priority, true - high priority
                                                 *   If the application configures a combination of high and low
                                                 *   priority entries, depending on the usage demand on the SAR
                                                 *   from High Priority Entries, a Low Priority Entry might stay in
                                                 *   HOLD state beyond a specified limit, set by
                                                 *   \ref Cy_HPPASS_SAR_SetHoldViolationCnt function. To ensure that
                                                 *   the Low Priority Entry did not stay in HOLD state beyond this
                                                 *   limit, before reading a Low Priority Entry result, check the
                                                 *   \ref Cy_HPPASS_SAR_GetHoldViolationStatus function status to
                                                 *   ensure that the result is within spec.
                                                 *   Refer to device TRM for more details.
                                                 */
    bool continuous;                            /**< Continuous mode. If true - this entry will automatically be
                                                 *   re-triggered when the current conversion of all channels in
                                                 *   this entry has been completed. In general a continuous Entry
                                                 *   should have additional sample time
                                                 *   (cy_stc_hppass_sar_grp_t::sampTime is not
                                                 *   \ref CY_HPPASS_SAR_SAMP_TIME_DISABLED), otherwise this Entry
                                                 *   will be continuously triggered and use the majority of the SAR
                                                 *   performance bandwidth. Sample time is the only way to set the
                                                 *   period of a continuous Entry.
                                                 */
} cy_stc_hppass_sar_grp_t;


/** The limit crossing detection configuration structure
 * \note The limit crossing detection block cannot be assigned to multiple channels/filters with different sign
 *       settings (filters are always signed).
 */
typedef struct
{
    cy_en_hppass_sar_cond_t cond;   /**< Limit Crossing Detection condition */
    int32_t low;                    /**< Low limit. The valid range is -32768 ... 32766 for signed values
                                     *   and 0 ... 65534 for unsigned values.
                                     */
    int32_t high;                   /**< High limit. The valid range is -32767 ... 32767 for signed values
                                     *   and 1 ... 65535 for unsigned values.
                                     */
} cy_stc_hppass_sar_limit_t;


