RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/** The FIR filter Configuration structure */
typedef struct
{
    cy_en_hppass_fir_chan_t chan;           /**< Filtering channel selection */
    bool waitTapInit;                       /**< Wait for 16 samples before the first valid result is available
                                             *   by the \ref Cy_HPPASS_SAR_Result_FirRead function or FIFO.
                                             *   This allows to ignore the FIR results until the FIR pipeline is
                                             *   initialized.
                                             */
    int16_t coef[CY_HPPASS_FIR_TAP_NUM];    /**< FIR Coefficient Values
                                             *   The coefficient values can range from -1+1/2^15 to 1-1/2^15
                                             *   with a resolution of 1/2^15.
                                             *   The coefficient uses twos-complement notation and
                                             *   the decimal point is fixed to the right of the most significant bit.
                                             *   Examples: -0.25 = 0xE000 and 0.25 = 0x2000
                                             *   The max absolute value of the FIR gain must be less than 8
                                             *  (sum of all the coefficients), otherwise the result may overflow
                                             *   allocated 16-bits.
                                             */
    cy_en_hppass_sar_limit_t limit;         /**< Limit crossing detector selection */
    bool result;                            /**< The result is available by the \ref Cy_HPPASS_SAR_Result_FirRead function
                                             *   and the result interrupt is generated.
                                             */
    cy_en_hppass_fifo_t fifo;               /**< FIFO selection */
} cy_stc_hppass_fir_t;


/** The FIFO buffer Configuration structure */
typedef struct
{
    cy_en_hppass_fifo_mode_t mode;      /**< Split mode */
    uint8_t trigMsk;                    /**< Enable trigger mask, see \ref group_hppass_fifo_trigger */
    uint8_t level[CY_HPPASS_FIFO_NUM];  /**< Level settings. Valid range 1..32, 1..16 or 1..8, depends on
                                         *   \ref cy_stc_hppass_fifo_t::mode
                                         */
} cy_stc_hppass_fifo_t;


/** The Channel Configuration structure */
typedef struct
{
    bool diff;                      /**< Differential mode: false - disabled, true - enabled */
    bool sign;                      /**< Signed data mode: false - unsigned, true - signed */
    cy_en_hppass_sar_avg_t avg;     /**< Averaging mode */
    cy_en_hppass_sar_limit_t limit; /**< Limit Crossing Detection block selection */
    bool result;                    /**< The result is available by \ref Cy_HPPASS_SAR_Result_ChannelRead
                                     *   and the result interrupt is generated.
                                     */
    cy_en_hppass_fifo_t fifo;       /**< FIFO selection */
} cy_stc_hppass_sar_chan_t;


/** The SAR configuration structure */
typedef struct
{
    cy_en_hppass_sar_vref_t vref;   /**< SAR voltage reference source */
    bool lowSupply;                 /**< Low Supply mode: Should be set false if VDDA >= 2.7V and true if VDDA < 2.7V */
    bool offsetCal;                 /**< Enable the offset calibration during startup */
    bool linearCal;                 /**< Enable the linearity calibration during startup */
    bool gainCal;                   /**< Enable the gain calibration during startup */
    bool chanId;                    /**< FIFO Channel Number Identifier Enable */
    bool aroute;                    /**< Enable global AROUTE */
    uint16_t dirSampEnMsk;          /**< Static Enables for Direct Samplers.
                                     *   Must be set if in use by application, otherwise it is OFF and must not be
                                     *   selected in any Sequencer Group.
                                     *   A given Sequencer Group is considered invalid if
                                     *   * There are no Samplers enabled and
                                     *   * For the given set of enabled Samplers, they all must be powered ON with
                                     *     this static setting.
                                     *   If the Group is invalid, no action will be taken in the Sequencer if this
                                     *   Group is triggered.
                                     */
    uint8_t muxSampEnMsk;           /**< Static Enables for Muxed Samplers.
                                     *   Must be set if in use by application, otherwise it is OFF and must not be
                                     *   selected in any Sequencer Group. Refer to cy_stc_hppass_sar_t::dirSampEnMsk
                                     *   for details.
                                     */
    uint16_t holdCount;             /**< This is the a global max HOLD count applied to all entries.
                                     *   The resolution of each count is 16 HPPASS high frequency clock counts.
                                     *   For example, if the HPPASS high frequency clock is 160MHz, each count will be
                                     *   16/160MHz = 100ns. The default value for this field is 30 counts
                                     *   (3us at 160MHz).
                                     */
    cy_en_hppass_sar_samp_gain_t dirSampGain[CY_HPPASS_SAR_DIR_SAMP_NUM];   /**< The array of the direct sampler gain
                                                                             *   settings. For the odd samplers which
                                                                             *   are used as a pseudo-differential
                                                                             *   negative the gain must be the same as
                                                                             *   in the correspondent even positive
                                                                             *   sampler.
                                                                             */
    cy_en_hppass_sar_samp_gain_t muxSampGain[CY_HPPASS_SAR_MUX_SAMP_NUM];   /**< The array of the muxed sampler gain
                                                                             *   settings. For the odd samplers which
                                                                             *   are used as a pseudo-differential
                                                                             *   negative the gain must be the same as
                                                                             *   in the correspondent even positive
                                                                             *   sampler.
                                                                             */
    uint16_t sampTime[CY_HPPASS_SAR_SAMP_TIME_NUM];                         /**< The array of the sampling timer
                                                                             *   apertures in clock cycles.
                                                                             *   Valid range is 1..1024
                                                                             */
    cy_stc_hppass_sar_chan_t const * chan[CY_HPPASS_SAR_CHAN_NUM];          /**< Array of pointers to the channel
                                                                             *   configuration structures. May contain
                                                                             *   NULL pointers for unused channels.
                                                                             */
    cy_stc_hppass_sar_grp_t const * grp[CY_HPPASS_SAR_GRP_NUM];             /**< Array of pointers to the SAR Sequencer
                                                                             *   Group configuration structures. May
                                                                             *   contain NULL pointers for unused groups.
                                                                             */
    cy_stc_hppass_sar_limit_t const * limit[CY_HPPASS_SAR_LIMIT_NUM];       /**< Array of pointers to the limit crossing
                                                                             *   detection configuration structures.
                                                                             *   May contain NULL pointers for unused
                                                                             *   ranges.
                                                                             */
    cy_en_hppass_sar_mux_t muxMode[CY_HPPASS_SAR_MUX_NUM];                  /**< Analog routing MUX control mode */
    cy_stc_hppass_fir_t const * fir[CY_HPPASS_FIR_NUM];                     /**< Array of pointers to the FIR
                                                                             *   configuration structures. May contain
                                                                             *   NULL pointers for unused filters.
                                                                             */
    cy_stc_hppass_fifo_t const * fifo;                                      /**< Pointer to the FIFO configuration
                                                                             *   structure. Can be NULL if FIFO is not
                                                                             *   used.
                                                                             */
} cy_stc_hppass_sar_t;


