RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/** \} group_hppass_sar_data_structures */


/***************************************
*        Function Prototypes
***************************************/


/**
* \addtogroup group_hppass_sar_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Init
****************************************************************************//**
*
* Loads the SAR ADC configuration.
* Can be used after the \ref Cy_HPPASS_Init function to update the SAR settings.
*
* \note If AC is running the initialization of SAR block is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note If the SAR block is currently busy the initialization is not allowed
* (\ref CY_HPPASS_SAR_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* SAR function cannot be protected from reinitialization during the
* 'block ready' == true condition, so it is on user's responsibility when
* and from where to call this function to reinitialize the SAR block.
*
* \param sarCfg
* Pointer to the SAR configuration structure \ref cy_stc_hppass_sar_t.
* The pointer cannot be NULL.
*
* \return
* Status of initialization, \ref cy_en_hppass_status_t.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_SAR_CFG
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_SAR_Init(const cy_stc_hppass_sar_t * sarCfg);


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_DeInit
****************************************************************************//**
*
* Resets all the SAR registers to their default state.
*
*******************************************************************************/
void Cy_HPPASS_SAR_DeInit(void);


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_IsBusy
****************************************************************************//**
*
* Returns the SAR ADC busy status.
*
* \note Do not use this function with continuous Sequencer Group mode
* \ref cy_stc_hppass_sar_grp_t::continuous.
* See the Device Datasheet Errata section for more details.
*
* \return
* Busy status: true - busy, false - idle.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_IS_BUSY
*
*******************************************************************************/
__STATIC_INLINE bool Cy_HPPASS_SAR_IsBusy(void)
{
    return _FLD2BOOL(HPPASS_SAR_CFG_SAR_STATUS_BUSY, HPPASS_SAR_STATUS(HPPASS_BASE));
}


/** \cond
* Internal function - not to be used in the user code.
* The function suppress the ADC 'busy' condition check
* in case when it is called from the cy_hppass_sar.c file
* to do not repeat this checks repeatedly in 'for' cycles.
* It also contain AC running conditional check.
*/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_SAR_CondBusyCheck(void)
{
    #if !defined CY_HPPASS_SUPPRESS_ADC_BUSY_CHECK
        cy_en_hppass_status_t result = Cy_HPPASS_AC_CondRunCheck();

        if ((CY_HPPASS_SUCCESS == result) && Cy_HPPASS_SAR_IsBusy())
        {
            result = CY_HPPASS_SAR_INVALID_STATE;
        }

        return result;
    #else
        return CY_HPPASS_SUCCESS;
    #endif
}
/** \endcond */


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_Config
****************************************************************************//**
*
* Configures the ADC limit crossing detection block.
*
* \note If AC is running this configuration is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note If the SAR block is currently busy the initialization is not allowed
* (\ref CY_HPPASS_SAR_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* SAR function cannot be protected from reinitialization during the
* 'block ready' == true condition, so it is on user's responsibility when
* and from where to call this function to reconfigure this SAR sub-block.
*
* \param limIdx
* The index of the limit crossing detection block. Valid range 0..7.
*
* \param limCfg
* Pointer to the limit crossing detection configuration structure
* \ref cy_stc_hppass_sar_limit_t. The pointer cannot be NULL.
*
* \return
* Status, \ref cy_en_hppass_status_t.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_CFG
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_SAR_Limit_Config(uint8_t limIdx, const cy_stc_hppass_sar_limit_t * limCfg)
{
    cy_en_hppass_status_t result = Cy_HPPASS_SAR_CondBusyCheck();

    if (CY_HPPASS_SUCCESS == result)
    {
        if ((NULL != limCfg) && (CY_HPPASS_SAR_LIMIT_NUM > limIdx))
        {
            CY_ASSERT_L3(CY_HPPASS_COND_VALID(limCfg->cond));
            CY_ASSERT_L2(CY_HPPASS_SAR_LIMIT_LOW_VALID(limCfg->low));
            CY_ASSERT_L2(CY_HPPASS_SAR_LIMIT_HIGH_VALID(limCfg->high));

            HPPASS_SAR_LIMIT_CFG(HPPASS_BASE, limIdx) = (uint32_t)limCfg->cond;
            HPPASS_SAR_LIMIT_LOW(HPPASS_BASE, limIdx) = (uint32_t)limCfg->low;
            HPPASS_SAR_LIMIT_HIGH(HPPASS_BASE, limIdx) = (uint32_t)limCfg->high;
        }
        else
        {
            result = CY_HPPASS_SAR_BAD_PARAM;
        }
    }

    return result;
}

#if ((CY_IP_MXS40MCPASS_VERSION == 1u) && (CY_IP_MXS40MCPASS_VERSION_MINOR == 0u))
/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_CrossTalkAdjust
****************************************************************************//**
*
* Adjusts the sampler offset trimming according to the number of simultaneously
* triggered (sampled and held) samplers, specified by groupMask
* (for single or multiple simultaneously triggered groups with same timing settings)
*
* Each sampler is compensated in relation to the other samplers that are sampled and held simultaneously.<br>
*
* Basic use case:
* - This function has to be called after the following functions calls:
* \ref Cy_HPPASS_Init, \ref Cy_HPPASS_SAR_Init, \ref Cy_HPPASS_SAR_GroupConfig, 
* or \ref Cy_HPPASS_SAR_TempAdjust.
*
* \note The Device Configurator automatically generates a call to this function during startup if the
* appropriate parameter in HPPASS configurations is checked.<br>
*
* Advanced use cases:
* - If a sampler is involved in multiple groups, this function has to be called each time before another
* one of these groups is triggered, to re-compensate the sampler within the another group.
* - If multiple groups are triggered simultaneously (by the same trigger signal), and
* the sampling timer settings for these groups are identical, this function has to be called with combined
* mask of the simultaneously triggered groups.
* 
* \note This function does not perform compensation for four or fewer simultaneously triggered samplers
* (within single or multiple groups), as the impact of compensation in these cases is negligible.
* \warning This function has not be used when VDDA is less than 2.7V, as this can cause
* over-compensation.
*
* \param groupMsk The \ref group_hppass_sar_group_mask "mask" of the simultaneously triggered groups
*
* \funcusage
*
* \snippet test_apps/hppass_sar_cross_talk_adjust/main.c SNIPPET_HPPASS_SAR_XTLK_CALL
*
*******************************************************************************/
void Cy_HPPASS_SAR_CrossTalkAdjust(uint8_t groupMsk);
#else
/** \cond INTERNAL */
__STATIC_INLINE void Cy_HPPASS_SAR_CrossTalkAdjust (uint8_t groupMsk)
{
    (void) groupMsk;
}
/** \endcond INTERNAL */
#endif

