RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_GroupConfig
****************************************************************************//**
*
* Configures a single Sequencer Group.
*
* \note If AC is running this configuration is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note If the SAR block is currently busy the initialization is not allowed
* (\ref CY_HPPASS_SAR_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* SAR function cannot be protected from reinitialization during the
* 'block ready' == true condition, so it is on user's responsibility when
* and from where to call this function to reconfigure this SAR sub-block.
*
* \param grpIdx
* The index of the Sequencer Group. Valid range 0..7.
*
* \param grpCfg
* Pointer to the Sequencer Group configuration structure \ref cy_stc_hppass_sar_grp_t.
* The pointer cannot be NULL.
*
* \return
* Status, \ref cy_en_hppass_status_t.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_SAR_GRP_CFG
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_SAR_GroupConfig(uint8_t grpIdx, const cy_stc_hppass_sar_grp_t * grpCfg)
{
    cy_en_hppass_status_t result = Cy_HPPASS_SAR_CondBusyCheck();

    if (CY_HPPASS_SUCCESS == result)
    {
        if ((NULL != grpCfg) && (CY_HPPASS_SAR_GRP_NUM > grpIdx))
        {
            HPPASS_SAR_SEQ_GROUP(HPPASS_BASE, grpIdx) = _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_DIRECT_SAMPLER_EN, grpCfg->dirSampMsk) |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_MUXED_SAMPLER_EN, grpCfg->muxSampMsk)  |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_MUX0_SEL, grpCfg->muxChanIdx[0U]) |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_MUX1_SEL, grpCfg->muxChanIdx[1U]) |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_MUX2_SEL, grpCfg->muxChanIdx[2U]) |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_MUX3_SEL, grpCfg->muxChanIdx[3U]) |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_TR_SEL, grpCfg->trig)             |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_SAMP_TIME_SEL, grpCfg->sampTime)  |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_PRIORITY, grpCfg->priority)       |
                                                        _VAL2FLD(HPPASS_SAR_SEQ_ENTRY_CONT, grpCfg->continuous);
        }
        else
        {
            result = CY_HPPASS_SAR_BAD_PARAM;
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_DisableGroupContConvert
****************************************************************************//**
*
* Disables continuous conversion for the specified SAR group
*
* \note If AC is running this configuration is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note to re-enable the continuous conversion, the restart of
* entire SAR block using \ref Cy_HPPASS_AC_Start is needed.
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* SAR function cannot be protected from reinitialization during the
* 'block ready' == true condition, so it is on user's responsibility when
* and from where to call this function to reconfigure this SAR sub-block.
*
* \param grpIdx
* The index of the Sequencer Group. Valid range 0..7.
*
* \return
* Status, \ref cy_en_hppass_status_t.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_DIS_GRP_CONT_CONVERT
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_SAR_DisableGroupContConvert(uint8_t grpIdx)
{
    cy_en_hppass_status_t result = Cy_HPPASS_AC_CondRunCheck();

    if (CY_HPPASS_SUCCESS == result)
    {
        if (CY_HPPASS_SAR_GRP_NUM > grpIdx)
        {
            HPPASS_SAR_SEQ_GROUP(HPPASS_BASE, grpIdx) &= ~HPPASS_SAR_SEQ_ENTRY_CONT_Msk;
        }
        else
        {
            result = CY_HPPASS_SAR_BAD_PARAM;
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_GetTriggerCollisionStatus
****************************************************************************//**
*
* Returns the Sequencer Group Trigger Collision Status for all the Groups.
*
* \return 8-bit Group mask (a bit per each Group).
* See \ref group_hppass_sar_trigger.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_GET_TR_COLLISION_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_HPPASS_SAR_GetTriggerCollisionStatus(void)
{
    return (uint8_t)HPPASS_SAR_GROUP_TR_COLLISION(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_ClearTriggerCollisionStatus
****************************************************************************//**
*
* Clears the Sequencer Group Trigger Collision Status for the specified Sequences.
*
* \param trigCollision The 8-bit Group mask (a bit per each Group).
* See \ref group_hppass_sar_trigger.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_CLR_TR_COLLISION_STATUS
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_ClearTriggerCollisionStatus(uint8_t trigCollision)
{
    HPPASS_SAR_GROUP_TR_COLLISION(HPPASS_BASE) = trigCollision;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_GetHoldViolationStatus
****************************************************************************//**
*
* Returns the Sequencer Group Hold Violation Status for all the Sequences.
*
* \return 8-bit Group mask (a bit per each Group).
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_GET_HOLD_VIOL_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_HPPASS_SAR_GetHoldViolationStatus(void)
{
    return (uint8_t)HPPASS_SAR_GROUP_HOLD_VIOLATION(HPPASS_BASE);
}


