RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_ClearHoldViolationStatus
****************************************************************************//**
*
* Clears the Sequencer Group Hold Violation Status for the specified Sequences.
*
* \param holdViolation The 8-bit Group mask (a bit per each Group).
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_CLR_HOLD_VIOL_STATUS
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_ClearHoldViolationStatus(uint8_t holdViolation)
{
    HPPASS_SAR_GROUP_HOLD_VIOLATION(HPPASS_BASE) = holdViolation;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_SetHoldViolationCnt
****************************************************************************//**
*
* Sets the common maximum hold count value for all the Sequencer Groups.
*
* \param cnt The hold count value.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_SET_HOLD_VIOL_CNT
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_SetHoldViolationCnt(uint16_t cnt)
{
    CY_ASSERT_L2(CY_HPPASS_SAR_GROUP_HOLD_CNT_VALID(cnt));
    HPPASS_SAR_GROUP_HOLD_CNT(HPPASS_BASE) = (uint32_t)cnt - 1UL;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_GetHoldViolationCnt
****************************************************************************//**
*
* Returns the common maximum hold count value for all the Sequencer Groups.
*
* \return
* The hold count value.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_SET_HOLD_VIOL_CNT
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_HPPASS_SAR_GetHoldViolationCnt(void)
{
    return (uint16_t)(1UL + HPPASS_SAR_GROUP_HOLD_CNT(HPPASS_BASE));
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_SetTempSensorCurrent
****************************************************************************//**
*
* Selects low or high current for temperature sensor.
*
* \param curr Current:
* false - BJT current is 1uA (default),
* true - Add 8uA to BJT current.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_tempAdjust/main.c SNIPPET_HPPASS_TEMP_CALC
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_SetTempSensorCurrent(cy_en_hppass_sar_temp_sensor_current_t curr)
{
    HPPASS_SAR_TEMPSENSE_CTRL(HPPASS_BASE) = (uint32_t)curr;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_TEMP_Calc
****************************************************************************//**
*
* Calculates the temperature based on two ADC reading results of
* temperature sensor.
* See the device Architecture Technical Reference Manual for more detail.
*
* \param tempHi ADC reading when the selected temp sensor is
* biased with a additional 8uA current.
*
* \param tempLo ADC reading when the selected temp sensor is
* biased with a 1uA current.
*
* \return
* Temperature value.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_tempAdjust/main.c SNIPPET_HPPASS_TEMP_CALC
*
*******************************************************************************/
__STATIC_INLINE int16_t Cy_HPPASS_TEMP_Calc(int16_t tempHi, int16_t tempLo)
{
    CY_ASSERT_L1(CY_HPPASS_SAR_ADC_TEMP_VALID(tempHi));
    CY_ASSERT_L1(CY_HPPASS_SAR_ADC_TEMP_VALID(tempLo));
    CY_ASSERT_L1(tempHi > tempLo);

    float ratio = ((float)tempHi - (float)tempLo) / (float)tempLo;

    float temp = (float)((int32_t)SFLASH_SAR_TEMP_COEF_A) * ratio * ratio * ratio +
                 (float)((int32_t)SFLASH_SAR_TEMP_COEF_B) * ratio * ratio +
                 (float)((int32_t)SFLASH_SAR_TEMP_COEF_C) * ratio +
                 (float)((int32_t)SFLASH_SAR_TEMP_COEF_D);

    return (int16_t)temp;
}

/** \cond BWC */
#define Cy_HPPASS_SAR_Adjust Cy_HPPASS_SAR_TempAdjust /*BWC Macros*/
/** \endcond BWC */

/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_TempAdjust
****************************************************************************//**
*
* Adjusts the offset calibration value according to input temperature value.
*
* \param temp The temperature value.
*
* \param vRef The reference voltage in mV used by the system in the field.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_ADJ
*
*******************************************************************************/
void Cy_HPPASS_SAR_TempAdjust(int16_t temp, uint16_t vRef);


/** \addtogroup group_hppass_sar_fir
*   \{ */

/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_FirConfig
****************************************************************************//**
*
* Initializes the ADC FIR filter.
*
* \note If AC is running this configuration is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note If the SAR block is currently busy the initialization is not allowed
* (\ref CY_HPPASS_SAR_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* SAR function cannot be protected from reinitialization during the
* 'block ready' == true condition, so it is on user's responsibility when
* and from where to call this function to reconfigure this SAR sub-block.
*
* \param firIdx
* The index of the FIR filter instance. Valid range 0..1.
*
* \param firCfg
* Pointer to the FIR filter configuration structure \ref cy_stc_hppass_fir_t.
* The pointer cannot be NULL.
*
* \return
* Status, \ref cy_en_hppass_status_t.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_fir_fifo/main.c SNIPPET_HPPASS_FIR_CFG
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_FIR_CFG_FUNC
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_SAR_FirConfig(uint8_t firIdx, const cy_stc_hppass_fir_t * firCfg)
{
    cy_en_hppass_status_t result = Cy_HPPASS_SAR_CondBusyCheck();

    if (CY_HPPASS_SUCCESS == result)
    {
        if ((NULL != firCfg) && (CY_HPPASS_FIR_NUM_VALID(firIdx)))
        {
            uint32_t resultMask_Pos = (uint32_t)firIdx + CY_HPPASS_SAR_FIR_0_IDX;
            uint32_t resultMask_Msk = CY_HPPASS_SAR_FIR_0_MSK << firIdx;

            CY_ASSERT_L3(CY_HPPASS_CHAN_VALID(firCfg->chan));
            CY_ASSERT_L3(CY_HPPASS_LIMIT_VALID(firCfg->limit));
            CY_ASSERT_L3(CY_HPPASS_FIFO_VALID(firCfg->fifo));

