RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
            HPPASS_SAR_FIR_CFG(HPPASS_BASE, firIdx) = _VAL2FLD(HPPASS_SAR_CFG_FIR_CFG_CHANNEL_SEL, firCfg->chan) |
                                                      _VAL2FLD(HPPASS_SAR_CFG_FIR_CFG_WAIT_TAP_INIT, firCfg->waitTapInit) |
                                                      _VAL2FLD(HPPASS_SAR_CFG_FIR_CFG_RANGE_SEL, firCfg->limit) |
                                                      _VAL2FLD(HPPASS_SAR_CFG_FIR_CFG_FIFO_SEL, firCfg->fifo);

            CY_REG32_CLR_SET(HPPASS_SAR_RESULT_MASK(HPPASS_BASE), resultMask, CY_HPPASS_BOOL_TO_UINT(firCfg->result));

            for (uint8_t i = 0U; i < CY_HPPASS_FIR_TAP_NUM; i++)
            {
                HPPASS_SAR_FIR_COEFS(HPPASS_BASE, firIdx, i) = (uint32_t)firCfg->coef[i];
            }
        }
        else
        {
            result = CY_HPPASS_SAR_BAD_PARAM;
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_FirRead
****************************************************************************//**
*
* Returns the the ADC FIR filter result.
*
* \param firIdx
* The index of the FIR filter instance. Valid range 0..1.
*
* \return FIR filter result
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_FIR_READ
*
*******************************************************************************/
__STATIC_INLINE int16_t Cy_HPPASS_SAR_Result_FirRead(uint8_t firIdx)
{
    CY_ASSERT_L1(CY_HPPASS_FIR_NUM_VALID(firIdx));

    return (int16_t)*CY_HPPASS_SAR_FIR_RSLT_PTR(firIdx);
}

/** \} group_hppass_sar_fir */


/**
* \addtogroup group_hppass_sar_chan
* \{
*/


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_ChannelConfig
****************************************************************************//**
*
* Initializes the ADC channel.
*
* \note If AC is running this configuration is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note If the SAR block is currently busy the initialization is not allowed
* (\ref CY_HPPASS_SAR_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* SAR function cannot be protected from reinitialization during the
* 'block ready' == true condition, so it is on user's responsibility when
* and from where to call this function to reconfigure this SAR sub-block.
*
* \param chanIdx
* The index of the channel. Valid range 0..27.
*
* \param chanCfg
* Pointer to the channel configuration structure \ref cy_stc_hppass_sar_chan_t.
* The pointer cannot be NULL.
*
* \return
* Status, \ref cy_en_hppass_status_t.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_SAR_CHAN_CFG
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_SAR_ChannelConfig(uint8_t chanIdx, const cy_stc_hppass_sar_chan_t * chanCfg)
{
    cy_en_hppass_status_t result = Cy_HPPASS_SAR_CondBusyCheck();

    if (CY_HPPASS_SUCCESS == result)
    {
        if ((NULL != chanCfg) &&
            (CY_HPPASS_SAR_CHAN_NUM_VALID(chanIdx)) &&
            (!chanCfg->diff || (CY_HPPASS_SAR_AVG_DISABLED == chanCfg->avg)))
        {
            uint32_t resultMask_Pos = chanIdx;
            uint32_t resultMask_Msk = CY_HPPASS_SAR_CHAN_0_MSK << resultMask_Pos;

            CY_ASSERT_L3(CY_HPPASS_AVG_VALID(chanCfg->avg));

            HPPASS_SAR_CHAN_CFG(HPPASS_BASE, chanIdx) = _VAL2FLD(HPPASS_SAR_CFG_CHAN_CFG_DIFFERENTIAL_EN, chanCfg->diff) |
                                                        _VAL2FLD(HPPASS_SAR_CFG_CHAN_CFG_SIGNED, chanCfg->sign) |
                                                        _VAL2FLD(HPPASS_SAR_CFG_CHAN_CFG_RANGE_SEL, chanCfg->limit) |
                                                        _VAL2FLD(HPPASS_SAR_CFG_CHAN_CFG_AVG_SEL, chanCfg->avg) |
                                                        _VAL2FLD(HPPASS_SAR_CFG_CHAN_CFG_FIFO_SEL, chanCfg->fifo);

            CY_REG32_CLR_SET(HPPASS_SAR_RESULT_MASK(HPPASS_BASE), resultMask, CY_HPPASS_BOOL_TO_UINT(chanCfg->result));
        }
        else
        {
            result = CY_HPPASS_SAR_BAD_PARAM;
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_GetStatus
****************************************************************************//**
*
* Returns the combined status of all the ADC channels and FIRs results.
*
* \return The ADC channels and FIRs results status \ref group_hppass_sar_status.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_GET_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Result_GetStatus(void)
{
    return HPPASS_SAR_RESULT_STATUS(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_ClearStatus
****************************************************************************//**
*
* Clears all the ADC channels and FIRs results status.
*
* \param mask
* The channels and FIRs status mask \ref group_hppass_sar_status.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_CLR_STATUS
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Result_ClearStatus(uint32_t mask)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(mask, CY_HPPASS_SAR_CHAN_MSK));

    HPPASS_SAR_RESULT_STATUS(HPPASS_BASE) = CY_HPPASS_SAR_CHAN_MSK & mask;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_ChannelRead
****************************************************************************//**
*
* Returns the ADC channel results.
*
* \param chanIdx
* The index of the channel instance. Valid range 0..27.
* \ref group_hppass_sar_chan_idx except FIR items.
*
* \return The ADC channels results.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_SAR_CHAN_READ
*
*******************************************************************************/
__STATIC_INLINE int16_t Cy_HPPASS_SAR_Result_ChannelRead(uint8_t chanIdx)
{
    CY_ASSERT_L1(CY_HPPASS_SAR_CHAN_NUM_VALID(chanIdx));

    return (int16_t)*CY_HPPASS_SAR_CHAN_RSLT_PTR(chanIdx);
}


