RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_ChannelPackedRead
****************************************************************************//**
*
* Returns the specified adjacent even/odd channel results from the channel
* result packed register.
*
* \param pairIdx
* The index of the adjacent even/odd channels pair instance. Valid range 0..13.
*
* \return The ADC even (low two bytes) and odd (high two bytes) channels results.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_CHAN_PACK_READ
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Result_ChannelPackedRead(uint8_t pairIdx)
{
    CY_ASSERT_L1((CY_HPPASS_SAR_CHAN_NUM / 2U) > pairIdx);

    return HPPASS_SAR_CHAN_RESULT_PACKED(HPPASS_BASE, pairIdx);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_GetOverflowStatus
****************************************************************************//**
*
* Returns the ADC groups and FIRs result overflow status.
*
* \return The ADC groups and FIRs results status \ref group_hppass_sar_result_interrupts
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_GET_OVF_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Result_GetOverflowStatus(void)
{
    return HPPASS_SAR_RESULT_OVERFLOW(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_ClearOverflowStatus
****************************************************************************//**
*
* Clears the ADC groups and FIRs result overflow status.
*
* \param mask
* The groups and FIRs result overflow status mask \ref group_hppass_sar_result_interrupts
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_CLR_OVF_STATUS
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Result_ClearOverflowStatus(uint32_t mask)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(mask, CY_HPPASS_INTR_SAR_RESULT));

    HPPASS_SAR_RESULT_OVERFLOW(HPPASS_BASE) = CY_HPPASS_INTR_SAR_RESULT & mask;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_GetStatus
****************************************************************************//**
*
* Returns the combined limit crossing detection status of all the ADC and FIR channels.
*
* \return The limit crossing detection status \ref group_hppass_sar_status
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_GET_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Limit_GetStatus(void)
{
    return HPPASS_SAR_LIMIT_STATUS(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_ClearStatus
****************************************************************************//**
*
* Clears the limit crossing detection status for all the ADC and FIR channels.
*
* \param mask
* The limit crossing detection status mask \ref group_hppass_sar_status
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_CLR_STATUS
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Limit_ClearStatus(uint32_t mask)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(mask, CY_HPPASS_SAR_CHAN_MSK));

    HPPASS_SAR_LIMIT_STATUS(HPPASS_BASE) = CY_HPPASS_SAR_CHAN_MSK & mask;
}

/** \} group_hppass_sar_chan */


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_GetInterruptStatus
****************************************************************************//**
*
* Returns the limit crossing interrupt register status.
*
* \return
* The status of combined interrupt requests for the SAR
* \ref group_hppass_sar_limit_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_GET_INT_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Limit_GetInterruptStatus(void)
{
    return HPPASS_SAR_LIMIT_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_ClearInterrupt
****************************************************************************//**
*
* Clears the limit crossing interrupt for SAR.
*
* \param interrupt
* The mask of interrupts to clear. Each bit of this mask is responsible for
* clearing of the particular interrupt in the SAR
* \ref group_hppass_sar_limit_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_CLEAR_INT_STATUS
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Limit_ClearInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_SAR_LIMIT));

    HPPASS_SAR_LIMIT_INTR(HPPASS_BASE) = CY_HPPASS_INTR_SAR_LIMIT & interrupt;

    /* This dummy reading is necessary here. It provides a guarantee that
    * interrupt is cleared at returning from this function.
    */
    (void)HPPASS_SAR_LIMIT_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_SetInterrupt
****************************************************************************//**
*
* Sets a software interrupt request for the specified limit crossing detection block.
*
* \param interrupt
* The mask of interrupts to set. Each bit of this mask is responsible for
* triggering of the particular interrupt in the SAR
* \ref group_hppass_sar_limit_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_SET_INT
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Limit_SetInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_SAR_LIMIT));

    HPPASS_SAR_LIMIT_INTR_SET(HPPASS_BASE) = CY_HPPASS_INTR_SAR_LIMIT & interrupt;
}


