RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_SetInterruptMask
****************************************************************************//**
*
* Enables the interrupt for the specified limit crossing detection block.
*
* \param interrupt
* The mask of interrupts allowable for activation. Each bit of this mask
* allows triggering of the particular interrupt in the SAR
* \ref group_hppass_sar_limit_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_SET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Limit_SetInterruptMask(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_SAR_LIMIT));

    HPPASS_SAR_LIMIT_INTR_MASK(HPPASS_BASE) = CY_HPPASS_INTR_SAR_LIMIT & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt mask for the specified limit crossing detection block.
*
* \return
* The mask of the interrupts allowable for activation
* \ref group_hppass_sar_limit_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_GET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Limit_GetInterruptMask(void)
{
    return HPPASS_SAR_LIMIT_INTR_MASK(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Limit_GetInterruptStatusMasked
****************************************************************************//**
*
* Gets limit crossing interrupt masked status.
*
* \return
* The masked status of combined interrupt requests for the SAR
* \ref group_hppass_sar_limit_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_LIM_GET_INT_MSKED
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Limit_GetInterruptStatusMasked(void)
{
    return HPPASS_SAR_LIMIT_INTR_MASKED(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_GetInterruptStatus
****************************************************************************//**
*
* Gets the SAR result interrupt status (ENTRY done, FIR done).
*
* \return
* The status of combined interrupt requests for the SAR
* \ref group_hppass_sar_result_interrupts.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_SAR_GET_INT_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Result_GetInterruptStatus(void)
{
    return HPPASS_SAR_RESULT_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_ClearInterrupt
****************************************************************************//**
*
* Clears SAR result interrupt
*
* \param interrupt
* The mask of interrupts to clear. Each bit of this mask is responsible for
* clearing of the particular interrupt in the SAR
* \ref group_hppass_sar_result_interrupts.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_basic/main.c SNIPPET_HPPASS_SAR_CLEAR_INT
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Result_ClearInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_SAR_RESULT));

    HPPASS_SAR_RESULT_INTR(HPPASS_BASE) = CY_HPPASS_INTR_SAR_RESULT & interrupt;

    /* This dummy reading is necessary here. It provides a guarantee that
    * interrupt is cleared at returning from this function.
    */
    (void)HPPASS_SAR_RESULT_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_SetInterrupt
****************************************************************************//**
*
* Sets a software SAR result interrupt request.
*
* \param interrupt
* The mask of interrupts to set. Each bit of this mask is responsible for
* triggering of the particular interrupt in the SAR
* \ref group_hppass_sar_result_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_SET_INT
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Result_SetInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_SAR_RESULT));

    HPPASS_SAR_RESULT_INTR_SET(HPPASS_BASE) = CY_HPPASS_INTR_SAR_RESULT & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_SetInterruptMask
****************************************************************************//**
*
* Enables the SAR result interrupt.
*
* \param interrupt
* The mask of interrupts allowable for activation. Each bit of this mask
* allows triggering of the particular interrupt in the SAR
* \ref group_hppass_sar_result_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_SET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_Result_SetInterruptMask(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_SAR_RESULT));

    HPPASS_SAR_RESULT_INTR_MASK(HPPASS_BASE) = CY_HPPASS_INTR_SAR_RESULT & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_GetInterruptMask
****************************************************************************//**
*
* Gets the SAR result interrupt mask.
*
* \return
* The mask of the interrupts allowable for activation
* \ref group_hppass_sar_result_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_GET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Result_GetInterruptMask(void)
{
    return HPPASS_SAR_RESULT_INTR_MASK(HPPASS_BASE);
}


