RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_Result_GetInterruptStatusMasked
****************************************************************************//**
*
* Gets the SAR result interrupt masked status.
*
* \return
* The masked status of combined interrupt requests for the SAR
* \ref group_hppass_sar_result_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_RESULT_GET_INT_MSKED
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_SAR_Result_GetInterruptStatusMasked(void)
{
    return HPPASS_SAR_RESULT_INTR_MASKED(HPPASS_BASE);
}


/**
* \addtogroup group_hppass_sar_fifo
* \{
*/


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_Config
****************************************************************************//**
*
* Initializes the FIFO buffer.
*
* \note If AC is running this configuration is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note If the SAR block is currently busy the initialization is not allowed
* (\ref CY_HPPASS_SAR_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* SAR function cannot be protected from reinitialization during the
* 'block ready' == true condition, so it is on user's responsibility when
* and from where to call this function to reconfigure this SAR sub-block.
*
* \param fifoCfg
* Pointer to the FIFO buffer structure \ref cy_stc_hppass_fifo_t.
* The pointer cannot be NULL.
*
* \return
* Status, \ref cy_en_hppass_status_t.
*
* \funcusage
*
* \snippet test_apps/hppass_sar_fir_fifo/main.c SNIPPET_HPPASS_SAR_FIFO_CFG_STR
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_CFG
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_FIFO_Config(const cy_stc_hppass_fifo_t * fifoCfg)
{
    cy_en_hppass_status_t result = Cy_HPPASS_SAR_CondBusyCheck();

    CY_ASSERT_L3(CY_HPPASS_MODE_VALID(fifoCfg->mode));
    CY_ASSERT_L2(CY_HPPASS_TRIGMSK_VALID(fifoCfg->trigMsk));

    if (CY_HPPASS_SUCCESS == result)
    {
        if (NULL == fifoCfg)
        {
            result = CY_HPPASS_SAR_BAD_PARAM;
        }
        else
        {
            HPPASS_MMIO_FIFO_CFG(HPPASS_BASE) = _VAL2FLD(HPPASS_MMIO_FIFO_CFG_SEL, fifoCfg->mode) |
                                                _VAL2FLD(HPPASS_MMIO_FIFO_CFG_FIFO_TR_EN, fifoCfg->trigMsk);

            for (uint8_t i = 0U; i < CY_HPPASS_FIFO_NUM; i++)
            {
                CY_ASSERT_L3(CY_HPPASS_LEVEL_VALID(fifoCfg->mode, fifoCfg->level[i]));

                HPPASS_MMIO_FIFO_LEVEL(HPPASS_BASE, i) = _VAL2FLD(HPPASS_MMIO_FIFO_LEVEL_LEVEL, (uint32_t)fifoCfg->level[i] - 1UL);
            }
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_GetSampleCount
****************************************************************************//**
*
* Returns the number of accumulated data words.
*
* \param fifoIdx
* The index of the FIFO part. Valid range 0..3,
* but depends on \ref cy_stc_hppass_fifo_t::mode setting.
*
* \return the number of accumulated data words.
* If fifoIdx is out of range then zero is returned.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_GET_SMP_CNT
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_HPPASS_FIFO_GetSampleCount(uint8_t fifoIdx)
{
    uint8_t result = 0U;

    if (CY_HPPASS_FIFO_NUM_VALID(fifoIdx))
    {
        result = (uint8_t)HPPASS_MMIO_FIFO_USED(HPPASS_BASE, fifoIdx);
    }
    else
    {
        CY_ASSERT_L1(false); /* The fifoIdx is invalid */
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_Read
****************************************************************************//**
*
* Returns the FIFO data word and the channel index
*
* \param fifoIdx
* The index of the FIFO part. Valid range 0..3,
* but depends on \ref cy_stc_hppass_fifo_t::mode setting
*
* \param chanIdx
* The pointer to the variable to store channel index
* \ref group_hppass_sar_chan_idx.
* This is optional - the pointer may be NULL
* (if channel index is not needed).
*
* \return the FIFO data word
* If fifoIdx is out of range then zero is returned.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_READ
*
*******************************************************************************/
__STATIC_INLINE int16_t Cy_HPPASS_FIFO_Read(uint8_t fifoIdx, uint8_t * chanIdx)
{
    int16_t result = 0;

    if (CY_HPPASS_FIFO_NUM_VALID(fifoIdx))
    {
        uint32_t rdData = *CY_HPPASS_SAR_FIFO_READ_PTR(fifoIdx);

        result = (int16_t)(uint16_t) _FLD2VAL(CY_HPPASS_FIFO_RD_DATA_RESULT, rdData);

        if (chanIdx != NULL)
        {
            * chanIdx = (uint8_t) _FLD2VAL(CY_HPPASS_FIFO_RD_DATA_CHAN_ID, rdData);
        }
    }
    else
    {
        CY_ASSERT_L1(false); /* The fifoIdx is invalid */
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_ReadAll
****************************************************************************//**
*
* Loads all the FIFO payload into the array.
*
* \param fifoIdx
* The index of the FIFO buffer. Valid range 0..3,
* but depends on \ref cy_stc_hppass_fifo_t::mode setting
*
* \param data
* Pointer to the data array
* User is responsible for enough array size,
* it depends on \ref cy_stc_hppass_fifo_t::mode setting
*
* \param chanIdxs
* Pointer to the array to store channel indexes
* \ref group_hppass_sar_chan_idx.
* User is responsible for enough array size,
* it depends on \ref cy_stc_hppass_fifo_t::mode setting
* Also this is optional - the pointer may be NULL
* (if channel indexes are not needed).
*
* \return the number of loaded data words
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_READ_ALL
*
*******************************************************************************/
uint8_t Cy_HPPASS_FIFO_ReadAll(uint8_t fifoIdx, int16_t * data, uint8_t * chanIdxs);


