RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_GetInterruptStatus
****************************************************************************//**
*
* Gets the interrupt register status for the specified FIFO.
*
* \return
* The status of combined interrupt requests for the FIFO
* \ref group_hppass_fifo_level_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_GET_INT_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_FIFO_GetInterruptStatus(void)
{
    return HPPASS_FIFO_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_SetInterrupt
****************************************************************************//**
*
* Sets a software interrupt request for the specified FIFO.
*
* \note This function works slightly different than any regular _SetInterrupt
* function (for example \ref Cy_HPPASS_SetInterrupt), because of
* different HPPASS_FIFO_INTR/INTR_SET level-based register behavior.
* See TRM for details.
*
* \param interrupt
* The mask of interrupts to be set. Each bit of this mask is responsible for
* triggering of the particular interrupt in the FIFO
* \ref group_hppass_fifo_level_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_SET_INT
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_FIFO_SetInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_FIFO));

    HPPASS_FIFO_INTR_SET(HPPASS_BASE) |= (CY_HPPASS_INTR_FIFO & interrupt);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt for the specified FIFO.
*
* \note This function works slightly different than any regular _ClearInterrupt
* function (for example \ref Cy_HPPASS_ClearInterrupt), because of
* different HPPASS_FIFO_INTR/INTR_SET level-based registers behavior.
* See TRM for details.
*
* \param interrupt
* The mask of interrupts to be cleared. Each bit of this mask is responsible for
* triggering of the particular interrupt in the FIFO
* \ref group_hppass_fifo_level_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_CLR_INT
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_FIFO_ClearInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_FIFO));

    HPPASS_FIFO_INTR_SET(HPPASS_BASE) &= ~(CY_HPPASS_INTR_FIFO & interrupt);

    /* This dummy reading is necessary here. It provides a guarantee that
    * interrupt is cleared at returning from this function.
    */
    (void)HPPASS_FIFO_INTR_SET(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_SetInterruptMask
****************************************************************************//**
*
* Enables the interrupt for the specified FIFO.
*
* \param interrupt
* The mask of interrupts allowable for activation. Each bit of this mask
* allows triggering of the particular interrupt in the FIFO
* \ref group_hppass_fifo_level_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_SET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_FIFO_SetInterruptMask(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_FIFO));

    HPPASS_FIFO_INTR_MASK(HPPASS_BASE) = CY_HPPASS_INTR_FIFO & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_GetInterruptMask
****************************************************************************//**
*
* Gets the interrupt mask for the specified FIFO.
*
* \return
* The mask of the interrupts allowable for activation
* \ref group_hppass_fifo_level_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_GET_INT_MSK
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_FIFO_GetInterruptMask(void)
{
    return HPPASS_FIFO_INTR_MASK(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_FIFO_GetInterruptStatusMasked
****************************************************************************//**
*
* Gets all FIFOs interrupt masked status.
*
* \return
* The masked status of combined interrupt requests for the FIFO
* \ref group_hppass_fifo_level_interrupts.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_FIFO_GET_INT_MSKED
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_FIFO_GetInterruptStatusMasked(void)
{
    return HPPASS_FIFO_INTR_MASKED(HPPASS_BASE);
}

/** \} group_hppass_sar_fifo */

/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_SetSwitch
****************************************************************************//**
*
* Sets selected AROUTE switch closed. Used for FW control input connections of
* the muxed samplers.
*
* \note This function works only if cy_stc_hppass_sar_t::muxMode is set to
* CY_HPPASS_SAR_MUX_FW for selected mux. See TRM for details.
*
* \param muxMask
* The mask of AROUTE switch.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_SET_SWITCH
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_SetSwitch(uint16_t muxMask)
{
    HPPASS_SAR_AROUTE_FW_CTRL(HPPASS_BASE) = (uint32_t)muxMask;
}


