RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_sar.h
/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_ClearSwitch
****************************************************************************//**
*
* Clears selected AROUTE switch open. Used for FW control input connections of
* the muxed samplers.
*
* \note This function works only if cy_stc_hppass_sar_t::muxMode is set to
* CY_HPPASS_SAR_MUX_FW for selected mux. See TRM for details.
*
* \param muxMask
* The mask of AROUTE switch.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_CLEAR_SWITCH
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_SAR_ClearSwitch(uint16_t muxMask)
{
    HPPASS_SAR_AROUTE_FW_CTRL_CLR(HPPASS_BASE) = (uint32_t)muxMask;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_GetSwitchStatus
****************************************************************************//**
*
* Reads the current state of the AROUTE switch.
*
* \return
* Read back the current state of the associated switch control.
*
* \funcusage
*
* \snippet hppass/snippet/hppass_sar.c SNIPPET_HPPASS_SAR_GET_SW_STATUS
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_HPPASS_SAR_GetSwitchStatus(void)
{
    return (uint16_t)HPPASS_SAR_AROUTE_STATUS(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_CountsTo_Volts
****************************************************************************//**
*
* Converts the raw ADC result in counts into the analog pin voltage in volts.
* For example, for the 0.534-volt ADC, the return value is 0.534.
* Voltage calculation depends on ADC channel work modes: Averaging,
* Signed, Pseudo-Differential, and Sampler Gain.
*
* The equation:
*
*     V = ((chanCounts + chanOffset * avgMultiplier) * vRef / 1000) / (4095 * avgMultiplier * samplerGain)
*
* where,
* - chanCounts: the raw counts from the SAR 16-bit CHAN_RESULT register
* - avgMultiplier: the multiplier value based on Averaging mode (\ref cy_stc_hppass_sar_chan_t) and the number of samples averaged
*   (\ref cy_en_hppass_sar_avg_t)
*   - \ref CY_HPPASS_SAR_AVG_DISABLED : avgMultiplier is 1<<0
*   - \ref CY_HPPASS_SAR_AVG_16 : avgMultiplier is 1<<4
* - chanOffset: the constant value based on Signed and Differential modes \ref cy_stc_hppass_sar_chan_t
*   - for Signed mode - true and Differential mode - disabled, chanOffset is 2048
*   - for Signed mode - false and Differential mode - enabled, chanOffset is -2048
*   - for all other cases, chanOffset is 0
* - vRef: the SAR ADC reference voltage in millivolts (for example, 3300U).
*
* \note
* This function is valid only for the right-aligned result.
*
* \param chanIdx
* The channel index . Valid range - 0..27.
*
* \param vRef
* The SAR ADC reference voltage in millivolts
*
* \param chanCounts
* Conversion result from \ref Cy_HPPASS_SAR_Result_ChannelRead
*
* \return
* The result in Volts.
*
* \funcusage
*
*******************************************************************************/
float32_t Cy_HPPASS_SAR_CountsTo_Volts(uint8_t chanIdx, uint16_t vRef, int16_t chanCounts);


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_CountsTo_mVolts
****************************************************************************//**
*
* Converts the raw ADC result in counts into the analog pin voltage in millivolts.
* For example, for the 0.534-volts ADC, the return value is 534.
* Voltage calculation depends on ADC channel work modes: Averaging,
* Signed, Pseudo-Differential, and Sampler Gain.
*
* The equation:
*
*     mV = ((chanCounts + chanOffset * avgMultiplier) * vRef) / (4095 * avgMultiplier * samplerGain)
*
* where,
* - chanCounts: the raw counts from the SAR 16-bit CHAN_RESULT register
* - avgMultiplier: the multiplier value based on Averaging mode (\ref cy_stc_hppass_sar_chan_t) and the number of samples averaged
*   (\ref cy_en_hppass_sar_avg_t)
*   - \ref CY_HPPASS_SAR_AVG_DISABLED : avgMultiplier is 1<<0
*   - \ref CY_HPPASS_SAR_AVG_16 : avgMultiplier is 1<<4
* - chanOffset: the constant value based on Signed and Differential modes \ref cy_stc_hppass_sar_chan_t
*   - for Signed mode - true and Differential mode - disabled, chanOffset is 2048
*   - for Signed mode - false and Differential mode - enabled, chanOffset is -2048
*   - for all other cases, chanOffset is 0
* - vRef: the SAR ADC reference voltage in millivolts (for example, 3300U).
*
* \note
* This function is valid only for the right-aligned result.
*
* \param chanIdx
* The channel index . Valid range - 0..27.
*
* \param vRef
* The SAR ADC reference voltage in millivolts
*
* \param chanCounts
* Conversion result from \ref Cy_HPPASS_SAR_Result_ChannelRead
*
* \return
* The result in millivolts.
*
* \funcusage
*
*******************************************************************************/
int16_t Cy_HPPASS_SAR_CountsTo_mVolts(uint8_t chanIdx, uint16_t vRef, int16_t chanCounts);


/*******************************************************************************
* Function Name: Cy_HPPASS_SAR_CountsTo_uVolts
****************************************************************************//**
*
* Converts the raw ADC result in counts into the analog pin voltage in microvolts.
* For example, for the 0.534-volts ADC, the return value is 534000.
* Voltage calculation depends on ADC channel work modes: Averaging,
* Signed, Pseudo-Differential, and Sampler Gain.
*
* The equation:
*
*     uV = ((chanCounts + chanOffset * avgMultiplier) * vRef * 1000)/ (4095 * avgMultiplier * samplerGain)
*
* where,
* - chanCounts: the raw counts from the SAR 16-bit CHAN_RESULT register
* - avgMultiplier: the multiplier value based on Averaging mode (\ref cy_stc_hppass_sar_chan_t) and the number of samples averaged
*   (\ref cy_en_hppass_sar_avg_t)
*   - \ref CY_HPPASS_SAR_AVG_DISABLED : avgMultiplier is 1<<0
*   - \ref CY_HPPASS_SAR_AVG_16 : avgMultiplier is 1<<4
*   - \ref CY_HPPASS_SAR_AVG_32 : avgMultiplier is 1<<4 in Signed mode and 1<<3 in Unsigned mode
* - chanOffset: the constant value based on Signed and Differential modes \ref cy_stc_hppass_sar_chan_t
*   - for Signed mode - true and Differential mode - disabled, chanOffset is 2048
*   - for Signed mode - false and Differential mode - enabled, chanOffset is -2048
*   - for all other cases, chanOffset is 0
* - vRef: the SAR ADC reference voltage in millivolts (for example, 3300U).
*
* \note
* This function is valid only for the right-aligned result.
*
* \param chanIdx
* The channel index . Valid range - 0..27.
*
* \param vRef
* The SAR ADC reference voltage in millivolts
*
* \param chanCounts
* Conversion result from \ref Cy_HPPASS_SAR_Result_ChannelRead
*
* \return
* The result in microvolts.
*
* \funcusage
*
*******************************************************************************/
int32_t Cy_HPPASS_SAR_CountsTo_uVolts(uint8_t chanIdx, uint16_t vRef, int16_t chanCounts);

/** \} group_hppass_sar_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40MCPASS */

#endif /** !defined(CY_HPPASS_SAR_H) */

/** \} group_hppass_sar */

/* [] END OF FILE */
